#include <iostream>
#include <vector>

using namespace std;

/**
 * Коли ми говоримо про масиви то індекси - це по суті offset.
 * Це логічно, оскільки у масиві у нас може бути лише 1 тип даних, і ми знаємо скільки пам'яті
 * займає цей тип даних, відповідно ми можемо порахувати адресу будь якого елементу масиву.
 * int займає 4 байти, відповідно arr[1] буде починатися з адреси початку + 4 байти
 *  *технічно int займає мінімум 2 байти, і на іншій машині може займати більше, але суть лишається та сама
 */


void changeArr(std::vector<int>& arr) {
    arr.at(1) = 77;
}

int main() {
    // // Так ми задаємо довжину масиву
    // int test_score [5]; // масив довжиною 5
    // constexpr int days_in_year {365};
    // double hi_temperatures [days_in_year]; // масив довжиною 5
    //
    // std::cout << test_score << std::endl; // 0x7f0a9ffd00 - це адреса па'яті де збереженно масив
    //
    // int test_score2 [4] {100, 95, 20, 88}; // Задали масив і наповнили його
    // int test_score3 [10] {100, 95,}; // Задали масив і заповнили його перші два елементи
    // int hi_temperatures2 [12] {0}; // Задали масив і заповнили всі його елементи 0
    // int hi_temperatures3 [12] {}; // Задали масив і заповнили всі його елементи 0
    // int hi_temperatures4 [12] {100}; // Задали масив і заповнили ЛИШЕ 0-ий елемент як 100, решта елементів порожні
    // int hi_temperatures5 [] {1,9,33,12,33,50,4}; // Задали масив і заповнили його. Розмір масиву визначився автоматично
    //
    // std::cout << hi_temperatures4[0] << std::endl; // 100
    // std::cout << hi_temperatures4[1] << std::endl; // 0


    // Отримання елементу
    // std::cout << test_score2[0] << std::endl; // 100
    // std::cout << test_score2[10] << std::endl; // 0 (вийшли за межі масиву)
    //
    // test_score2[10] = 3; // test_score2 має довжину 4. У мене помилку не видає, хоча дані не запише
    // std::cout << test_score2[10] << std::endl; //  3
    /**
     * Це дуже небезбечна помилка, бо C++ не виконує перевірку під час запуску,
     * і відповідно коли я вийшов за межі масиву і змінив щось - я міг змінити щось у іншій
     * змінній що може призвести до неправильної роботи програми, саме тому варто бути ДУЖЕ
     * обережним і користуватися Vecors замість Arrays
     */



    //.....................................................................
     /**
     * Array чи Vector - це однак структура даних у пам'яті, тобто якщо під масив
     * виділено 100 байт пам'яті то цей блок пам'яті нероздільний, він іде одним шматком.
     * Це можна побачити якщо вивести адреси у пам'яті
     */
    std::cout << sizeof(int) << '\n';
    int primes[] { 2, 3, 5, 7, 11 }; // hold the first 5 prime numbers (as int)
    std::cout << &(primes[0]) << '\n'; // 0x975cbff7b0
    std::cout << &(primes[1]) << '\n'; // 0x975cbff7b4
    std::cout << &(primes[2]) << '\n'; // 0x975cbff7b8

    // One of the biggest downsides of std::vector is that it cannot be made constexpr. If you need a constexpr array, use std::array.


    // .size() повертає тип size_type що є alias до std::size_t, і він містить unsign int
    std::vector<int> v2 {10, 2,4,1};
    std::cout << v2.size() << '\n'; // 4
    // unsigned int s {v2.size()}; // error, тому що тип не unsign int, а size_type, тож щоб працювало треба зробити static_cast
    unsigned int s2 {static_cast<unsigned int>(v2.size())};
    std::cout << s2 << '\n'; // 4

    // те сам і з std::size(), треба робити statix_cast
    size_t s3 {std::size(v2)};

    // std::ssize() повертає розмір масиву як large signed integral type і має тип std::ptrdiff_t
    auto s4 {std::ssize(v2)};


    /**
     * Що таке size_t і навіщо він здався?
     *
     * size_t — це не якийсь магічний тип, а псевдонім (alias). Його реальний тип залежить від вашого комп'ютера (архітектури процесора).
     *      На 32-бітному процесорі це зазвичай unsigned int (4 байти).
     *      На 64-бітному процесорі це зазвичай unsigned long long (8 байтів).
     *
     * Чому не просто int? Тип int історично має розмір 4 байти (навіть на 64-бітних системах).
     * Максимальне число в int — це близько 2 мільярдів. Якщо ваш масив (вектор) міститиме більше
     * ніж 2 мільярди елементів (що цілком реально на сучасних серверах з купою RAM), звичайний int просто
     * переповниться і програма зламається. size_t гарантовано має такий розмір, щоб покрити всю доступну пам'ять комп'ютера.
     *
     * Але також правда і те, що масив має обмеження по довжині.
     * Межа int (знаковий, 4 байти) 2^31 - 1 => 2 мільядри - саме тому
     * Межа size_t (беззнаковий, 8 байтів на 64-бітній системі) 2^64 - 1 => 18 квінтильйонів (18,446,744,073,709,551,615)
     */

    //...................................................................

    // Передача масиву як reference
    std::vector<int> v1 {4,11,3,0,9,5,2};

    std::cout << v1[1] << '\n'; // 11
    changeArr(v1);
    std::cout << v1[1] << '\n'; // 77

    std::vector<short> v3 {4,11,3,0,9,5,2};
    // changeArr(v3); // error





    // // Multi dimensional arrays
    // int movie_rating [3][4]; // Масив 3x4
    // constexpr int movie_rating2 [3][4] {
    //     {0,3,3,5},
    //     {4,1,2,3},
    //     {3,4,4,1}
    // };


    // Vectors
    // vector<char> movie_list;
    // vector<int> id_list;
    //
    // vector <int> id_list2 (4); // автоматично створили vector з розміром 4 і всі елементи 0
    // cout << id_list2[1] << endl; // 0

    // vector<char> movie_list {1,2,3};
    // vector<int> temperature (360, 80); // 360 - це розмір вектора, а 80 це значення яким буде наповнений кожен елемент;
    // cout << temperature[1] << endl; // 80

    // vector<int> a1 (3);
    // a1[0] = 20;
    // a1[8] = 44; // Помилка бо ми переповнили vector
    // cout << a1[8] << endl; // Помилка бо ми переповнили vector
    // cout << a1.at(8) << endl; // Помилка бо ми переповнили vector (але не така як вище)


    // vector<int> a {3,5,7};
    // a.push_back(99); // a = {3,5,7,99}
    // cout << a.size(); // 4


    // vector<vector<int>> a {
    //     {1,2,3},
    //     {4,5,6},
    //     {7,8,9}
    // };
    // cout << a.at(1).at(0); // 4
    // cout << a[1][0]; // 4


    vector<int> vector1 {10, 20};
    vector<vector<int>> vector_2d;
    vector_2d.push_back(vector1);
    cout << vector_2d.at(0).at(0) << " "; // 10
    cout << vector_2d.at(0).at(1) << endl; // 20

    vector1.at(0) = 1000;
    cout << vector_2d.at(0).at(0) << " "; // 10
    cout << vector_2d.at(0).at(1) << endl; // 20

    cout << vector1.at(0) << endl; // 1000

    /**
     * Якщо елементом 2d вектора є інший вектор - то це не працює як посилання,
     * тут робиться копія. Саме тому хоч ми і змінили значення vector1 у vector_2d
     * воно не змінилося.
     *
     * Для того щоб це був один об'єкт то треба передати посилання на вектор
     * vector<vector<int>*> vector_2d
     * vector_2d.push_back(&vector1);
     */



    return 0;
}