
/**
 * Варіант підключення 3 - за допомогою менеджера vcpkg чи conan.
 *
 * Будемо підключати просту бібліотеку nlohmann::json для роботи з JSON.
 * Ця бібліотека містить лише 1 .hpp файл
 *
 * Тут я використовую vcpkg, а саме розширення для CLion, загалом цей менеджер пакетів
 * після встановлення створить собі директорію, у мене це \.vcpkg-clion\vcpkg і там міститиме
 * всі бібліотеки які завантажені через нього. Це чимось схоже на завантаження на пряму, але
 * тут vcpkg бере на себе створення універсальної для всіх системи директорій і дає зручний спосіб
 * завантажити бібліотеку. Насправді якщо працює команда, то одна людина може використати vcpkg,
 * а інша conan, головне, щоб у кожного був підключений свій пакетний менеджер і завантажена бібліотека,
 * а далі CMakeLists.txt зробить все за нас.
 *
 * Тепер я переходжу у vcpkg, вписую у рядку пошуку nlohmann-json і натискаю завантажити.
 * Коли я завантажую у мене є вибір між купою різних збірок під різні платформи, я обираю
 * "Let vcpkg decide".
 *
 * Після встановлення vcpkg мені треба було додати в налаштуваннях CLion у CMake options рядок
 * -DCMAKE_TOOLCHAIN_FILE=C:/Users/formo/.vcpkg-clion/vcpkg/scripts/buildsystems/vcpkg.cmake
 *
 * Тепер після завантаження бібліотеки та підключення vcpkg треба прописати її додавання у CMakeLists.txt
 * Прописую find_package(nlohmann_json CONFIG REQUIRED)
 * та target_link_libraries(${PROJECT_NAME} PRIVATE nlohmann_json::nlohmann_json)
 * Ці два рядки мені запропонував vcpkg після встановлення бібліотеки, але також
 * можна їх знайти на сторінці бібліотеки в GitHub в розділі CMake
 *
 *
 * Для мене це була вельми складна процедура через обмеження комп'ютера, бо там стояла заборона
 * на завантаження з терміналу і довелося вручну завантажувати vcpkg, а також потім і зборщик проєкту ninga.
 * Якщо на це не зважати і вже мати налаштований vcpkg або інший пакетний менеджер то не повинно бути жодних
 * проблем, обрали бібліотеку, дозволили менеджеру обрати збірку під ваш комп і операційну систему,
 * додали підключення бібліотеки у CMakeLists.txt і все.
 */

#include <iostream>
#include <nlohmann/json.hpp>

// Щоб не писати щоразу nlohmann::json, робимо зручний аліас:
using json = nlohmann::json;

int main() {
    // Створюємо JSON об'єкт прямо в коді
    json user;
    user["name"] = "Oleksandr";
    user["age"] = 21;
    user["skills"] = {"C++", "Systems Programming"};

    // Виводимо його на екран (гарно відформатованим у 4 відступи)
    std::cout << user.dump(4) << std::endl;

    return 0;
}