
/**
 * Варіант підключення 3 з dynamic library - за допомогою менеджера vcpkg чи conan.
 *
 * Будемо підключати просту бібліотеку fmtlib для форматування тексту.
 * Ця бібліотека містить не лише 1 .hpp файл, а кілька. І також вона має як static варіант, так і dynamic варіант.
 * Тут ми будемо працювати з dynamic варіантом і оскільки я роблю це на Windows, то будемо працювати з .dll файлами.
 *
 * Уявляємо що у нас вже встановлений vcpkg.
 * Я встановлюю fmtlib (шукається за назвою fmt) через vcpkg. Коли я завантажую у мене є вибір між купою
 * різних збірок під різні платформи, я обираю "Let vcpkg decide".
 *
 * Перевага цього методу в тому, що мені не треба самому власноруч копіювати .dll файли на Windows, vcpkg робить це за мене.
 * Тобто наш CMakeLists.txt такий самий, як коли ми і підключали бібліотеку з одним .hpp.
 *
 * Для static бібліотеки все те саме, що і для dynamic, це дуже зручно. Ми просто оберемо потрібний триплет.
 *
 *
 */

#include <fmt/core.h>
#include <fmt/color.h>
#include <iostream>

int main() {
    // Просте форматування рядка
    std::string name = "Олексій";
    int age = 20;
    fmt::print("Привіт, {}! Тобі вже {} років.\n", name, age);

    // Магія fmt: виведення кольорового тексту в консоль!
    fmt::print(fg(fmt::color::crimson) | fmt::emphasis::bold,
               "Цей текст динамічно скомпілювався і став червоним!\n");

    std::cin.get(); // Wait for user input


    /**
     * Тільки треба запускати код не в терміналі від CLion, бо він не буде працювати як треба,
     * замість кольорів буде виводити спеціальні символи. Треба згенерувати .exe і запустити його,
     * тоді відкриється звичайний термінал із кольором.
     */
    return 0;
}