#include <deque>
#include <iostream>
#include <list>
#include <memory>
#include <mutex>
#include <stack>

    /**
     * Основна проблема це race condition
     * Race condition зазвичай виникають, коли для завершення операції потрібно змінити два або більше різних
     * фрагментів даних, наприклад, два покажчики посилань. Не можна щоб другий потік отримав доступ до даних
     * поки в першому потоці відбуваються зміни, інакше другий може вклинитися на половині процесу змін
     * і отримати зламані дані (наприклад у double linked list щоб видалити якусь node нам треба поміняти
     * два pointer, але якщо другий потік вклиниться коли ми видалили одну ноду і ще не дійшли до другої,
     * то наша структура даних буде неправильною)
     *
     *
     * Існує кілька способів боротьби з race condition:
     *
     * Найпростіший варіант — обгорнути структуру даних механізмом захисту, щоб гарантувати, що тільки потік,
     * який виконує модифікацію, може бачити проміжні стани, в яких порушуються інваріанти (інваріант - це
     * незмінна річ, в нашому випадку з double linked list - це те що має бути два pointer на next і prev,
     * якщо ми хочемо видалити ноду і видалили pointer next то інваріант зламаний до моменту поки ми
     * не видалимо pointer prev).
     * З точки зору інших потоків, що отримують доступ до цієї структури даних, такі модифікації або ще
     * не розпочалися, або вже завершилися.
     *
     * Інший варіант полягає в тому, щоб змінити дизайн вашої структури даних та її інваріантів таким чином,
     * щоб модифікації виконувалися як серія неподільних змін, кожна з яких зберігає інваріанти.
     * Це зазвичай називають безблокувальним програмуванням, і це важко зробити правильно.
     * Якщо ви працюєте на цьому рівні, нюанси моделі пам'яті та визначення того, які потоки можуть потенційно
     * бачити який набір значень, можуть стати складними.
     *
     * Інший спосіб вирішення проблем, пов'язаних з гонкою умов, полягає в обробці оновлень структури даних як
     * транзакції, так само як оновлення бази даних виконуються в рамках транзакції. Необхідна серія модифікацій
     * та читань даних зберігається в журналі транзакцій, а потім фіксується в один крок. Якщо фіксація не
     * може бути виконана, оскільки структура даних була модифікована іншим потоком, транзакція перезапускається.
     * Це називається програмною транзакційною пам'яттю (STM). В C++ немає прямої підтримки STM
     * (хоча існує технічна специфікація розширень транзакційної пам'яті для C++)
     *
     *
     * ***********************************************************************************
     *
     * Захист спільних даних за допомогою м'ютексів
     *
     * Чи не було б добре, якби ви могли позначити всі фрагменти коду, що мають доступ до структури даних,
     * як взаємовиключні, щоб у разі виконання одного з них будь-яким потоком, будь-який інший потік, що
     * намагається отримати доступ до цієї структури даних, мав чекати, поки перший потік не завершить свою роботу?
     *
     * Власне це м'ютекс (mutex) і робить. Перед доступом до спільної структури даних ви блокуєте (lock) м'ютекс,
     * пов'язаний з цими даними, а після завершення доступу до структури даних ви розблоковуєте (unlock) м'ютекс.
     * Бібліотека потоків (Thread Library) гарантує, що після того, як один потік заблокував певний м'ютекс,
     * всі інші потоки, які намагаються заблокувати той самий м'ютекс, повинні чекати, поки потік, який
     * успішно заблокував м'ютекс, розблокує його
     *
     */


    /**
     * Mutex
     * У C++ ви створюєте м'ютекс, створюючи екземпляр std::mutex, блокуєте його за допомогою виклику
     * функції-члена lock() і розблоковуєте за допомогою виклику функції-члена unlock(). Але не рекомендується
     * викликати функції-члени безпосередньо, оскільки це означає, що ви повинні пам'ятати про виклик unlock()
     * на кожному шляху коду поза функцією. А якщо станеться exception то unlock() не буде викликано.
     * Натомість стандартна бібліотека C++ надає шаблон класу std::lock_guard, який реалізує
     * ідіому RAII для м'ютекса; він блокує наданий м'ютекс під час створення і розблоковує його під час
     * знищення, гарантуючи, що заблокований м'ютекс завжди буде правильно розблокований.
     *
     * Хоча є випадки, коли таке використання глобальних змінних є доречним, у більшості випадків зазвичай
     * групують м'ютекс і захищені дані в класі, а не використовують глобальні змінні. Це стандартне застосування
     * правил об'єктноорієнтованого проєктування: розміщуючи їх у класі, ви чітко позначаєте їх як пов'язані,
     * і можете інкапсулювати функціональність та забезпечити захист
     *
     */


// Наші спільні дані
std::list<int> some_list;
// Наш замок (м'ютекс)
std::mutex some_mutex;

void add_to_list(int new_value) {
    // 1. Створюємо "охоронця". Він негайно викликає some_mutex.lock().
    // Якщо інший потік вже захопив м'ютекс, цей потік "засне" тут і чекатиме.
    std::lock_guard<std::mutex> guard(some_mutex);

    // 2. Тепер ми в безпеці. Тільки один потік може виконувати цей рядок одночасно.
    some_list.push_back(new_value);

    // 3. Коли функція завершується (дужка нижче), об'єкт 'guard' автоматично нищиться.
    // В його деструкторі викликається some_mutex.unlock(). Замок відкрито!
}

void print_list() {
    // Тут теж потрібен замок, щоб не читати дані, поки інший потік їх змінює
    std::lock_guard<std::mutex> guard(some_mutex);
    for (int n : some_list) {
        std::cout << n << " ";
    }
    std::cout << std::endl;
}

/**
 * Але у написаного вище коду є великий недолік!
 * Важливо розуміти що mutex не робить блокування, якщо ми звертаємося до pointer чи reference,
 * тобто навіть якщо ми заблокували дані через lock() але десь маємо на нього pointer то власник
 * pointer може зайти і змінити дані.
 *
 * У наведеному нижче прикладі код у process_data виглядає досить нешкідливим, добре захищеним за допомогою
 * std::lock_guard, але виклик функції func, наданої користувачем, означає, що foo може передати
 * malicious_function, щоб обійти захист, а потім викликати do_something() без блокування м'ютекса.
 *
 * Від цього немає захисту, тому не передавайте покажчики та посилання на захищені дані за межі області
 * дії блокування, будь то повернення їх з функції, зберігання у зовнішній пам'яті або передача як
 * аргументів до функцій, наданих користувачем!
 *
 */

class Some_data {
    int a;
    std::string b;
public:
    void do_something();
};

class Data_wrapper {
private:
    Some_data data;
    std::mutex m;
public:
    template<typename Function>
    void process_data(Function func) {
        std::lock_guard<std::mutex> l(m);
        func(data);
    }
};

Some_data* unprotected;
void malicious_function(Some_data& protected_data) {
    unprotected=&protected_data;
}

Data_wrapper x;
void foo() {
    x.process_data(malicious_function);
    unprotected->do_something();
}


/**
 * Наявність м'ютекса не гарантує відсутності помилок, якщо сам дизайн інтерфейсу (набір функцій) кривий.
 * Розглянемо приклад Stack
 * Навіть якщо кожна функція стека (empty(), top(), pop()) всередині захищена м'ютексом, між ними є "дірки".
 * Нехай у нас є код і він окремо запустить у двох потоках
 * stack<int> s;
 * if(!s.empty()) {
 *  int const value=s.top();
 *  s.pop();
 *  do_something(value);
 * }
 *
 * Thread A перевіряє if(!s.empty()). Стек не пустий.
 * Thread B перевіряє if(!s.empty()). Стек все ще не пустий.
 * Thread A викликає value = s.top(). Отримує верхній елемент (наприклад, 5).
 * Thread B викликає value = s.top(). Теж отримує 5!
 * Thread A викликає s.pop(). Видаляє 5.
 * Thread B викликає s.pop(). Видаляє наступний елемент (наприклад, 10)
 *
 * Чому не можна просто об'єднати top() і pop()?
 * Здавалося б, зробимо функцію int pop(), яка і повертає значення, і видаляє його. Але тут виникає проблема виключень (exceptions):
 * Якщо ми спочатку видалимо елемент, а потім почнемо його копіювати для повернення, і в цей момент забракне пам'яті (std::bad_alloc),
 * то елемент зі стека вже видалено, а користувач його не отримав. Дані втрачені назавжди. (Забракнути пам'ять може, бо система перевантажена
 * іншими запитами і це цілком реально)
 *
 * Чотири варіанти вирішення (Options)
 * Щоб зробити стек безпечним, автор пропонує змінити його інтерфейс:
 *  Варіант 1: Передати посилання. void pop(T& value). Ти заздалегідь створюєш змінну, передаєш її у функцію, і стек записує
 *             туди значення під замком. Якщо копіювання не вдалося, стек ще не видалив дані.
 *  Варіант 2: Заборонити виключення. Дозволити використовувати стек тільки для типів, чиє копіювання ніколи не викликає помилок (no-throw).
 *  Варіант 3: Повертати вказівник. std::shared_ptr<T> pop(). Копіювання вказівника ніколи не викликає помилок. Це безпечно і зручно.
 *  Варіант 4: Комбінація. Реалізувати і 1, і 3 варіанти.
 *
 * Саме тому нижче створено Threadsafe_stack який реалізовує варіант 4
 */

template<typename T,typename Container=std::deque<T> >
class Stack {
public:
    explicit Stack(const Container&);
    explicit Stack(Container&& = Container());
    template <class Alloc> explicit Stack(const Alloc&);
    template <class Alloc> Stack(const Container&, const Alloc&);
    template <class Alloc> Stack(Container&&, const Alloc&);
    template <class Alloc> Stack(Stack&&, const Alloc&);
    bool empty() const;
    size_t size() const;
    T& top();
    T const& top() const;
    void push(T const&);
    void push(T&&);
    void pop();
    void swap(Stack&&);
    template <class... Args> void emplace(Args&&... args);
};


/**
 * Threadsafe_stack_interface - це те як має виглядати потоко (threads) безпечний stack
 * є два перевантаження pop(), одне з яких приймає посилання на місце, де зберігається значення,
 * а інше повертає std::shared_ptr<>. Він має простий інтерфейс, що містить лише дві функції: push() і pop()
 *
 * Threadsafe_stack - це власне реалізація інтерфейсу що ми описали
 * pop (варіант 3) робить наступне:
 *  std::make_shared<T>(data.top()), копіюємо дані зі стека в нову ділянку пам'яті, якою керує smart_pointer
 *  Якщо пам'яті забракло, то ми не зробили копію, стався exception std::bad_alloc і ми не зробили data.pop(),
 *  якщо пам'яті достатньо, то робимо копію і видаляємо елемент через data.top(). Але навіщо нам smart_pointer,
 *  чому б не зробити копію у просту змінну?
 *
 *  T res = data.top(); // 1. Копіюємо дані в локальну змінну
 *  data.pop();         // 2. Видаляємо дані зі стека
 *  return res;         // 3. Повертаємо копію користувачу (тут може бути ще одне копіювання і відповідно ще одна помилка)
 *
 *  Отож відповідь: тому, що копіювання самого shared_ptr (вказівника) гарантовано не викидає виключень.
 *  Ми спокійно передаємо користувачу доступ до вже створеного об'єкта і потім деструктор lock_guard автоматично відкриває м'ютекс.
 *
 * pop (варіант 1) - ми приймаємо reference і спочатку записуємо у неї змінну і лише потім видаляємо, гарантуючи, що лише
 * якщо копіювання пройшло успішно ми видаляємо елемент і потім деструктор lock_guard автоматично відкриває м'ютекс.
 *
 *
 * Конструктор копіювання (Копіювання іншого стека)
 * Ось тут починається найцікавіше. Коли ми хочемо створити новий стек як копію вже існуючого, нам треба бути впевненими,
 * що "оригінал" не зміниться в процесі копіювання.
 * Захист джерела: Ми замикаємо м'ютекс того стека, з якого копіюємо. Це гарантує, що поки ми читаємо дані з other.data,
 * жоден інший потік не зможе викликати push або pop для цього об'єкта.
 */
struct empty_stack: std::exception {
    const char* what() const noexcept;
};

template<typename T>
class Threadsafe_stack_interface {
public:
    Threadsafe_stack_interface();
    Threadsafe_stack_interface(const Threadsafe_stack_interface&);
    Threadsafe_stack_interface& operator=(const Threadsafe_stack_interface&) = delete;
    void push(T new_value);
    std::shared_ptr<T> pop();
    void pop(T& value);
    bool empty() const;
};

template<typename T>
class Threadsafe_stack {
private:
    std::stack<T> data;
    mutable std::mutex m; // mutable дозволяє замикати м'ютекс навіть у const функціях

public:
    // Копіювання стека: замикаємо м'ютекс ОБОХ об'єктів (джерела точно)
    Threadsafe_stack(const Threadsafe_stack& other) {
        std::lock_guard<std::mutex> lock(other.m);
        data = other.data;
    }

    void push(T new_value) {
        std::lock_guard<std::mutex> lock(m);
        data.push(std::move(new_value)); // Додаємо дані під замком
    }

    // БЕЗПЕЧНИЙ POP (Варіант 3)
    std::shared_ptr<T> pop() {
        std::lock_guard<std::mutex> lock(m);
        if(data.empty()) throw empty_stack(); // Перевірка і дія в ОДНОМУ замку

        // Створюємо shared_ptr перед тим, як видалити зі стека
        std::shared_ptr<T> const res(std::make_shared<T>(data.top()));
        data.pop();
        return res;
    }

    // БЕЗПЕЧНИЙ POP (Варіант 1)
    void pop(T& value) {
        std::lock_guard<std::mutex> lock(m);
        if(data.empty()) throw empty_stack();
        value = data.top();
        data.pop();
    }
};




int main() {




    return 0;
}
