#include <iostream>
#include "add.h" //  Це просто копіює вміст add.h файлу, а в ньому міститься forward declaration функції add

/**
 * Можна помітити що <isostream> знаходиться у дужках, а от "add.h" у лапках
 * Коли ми використовуємо кутові дужки, ми повідомляємо препроцесору, що це файл заголовка,
 * який писали не ми самі. Препроцесор шукатиме заголовок лише у спеціальних каталогах
 * для include directories.
 *
 * include directories налаштовуються в рамках налаштувань вашого проєкту/IDE/компілятора
 * і зазвичай за замовчуванням містять каталоги з файлами заголовків, що постачаються разом
 * із вашим компілятором та/або ОС.
 *
 * Препроцесор не шукатиме файл заголовка в каталозі вихідного коду вашого проєкту.
 *
 *
 * Використовуйте подвійні лапки для включення файлів заголовків, які ви написали або які,
 * як очікується, знаходяться в поточному каталозі.
 * Використовуйте кутові дужки для включення заголовків, що поставляються разом з вашим компілятором,
 * ОС або сторонніми бібліотеками, які ви встановили в інших місцях вашої системи.
 *
 *
 *
 * #include <iostream> і #include <iostream.h> це оде і те саме
 * #include <iostream.h> це старий підхід
 * #include <iostream> - це новий підхід який зберігає сумісність
 */

int main(){
	std::cout << "The sum of 3 and 4 is " << add(3, 4) << '\n';

	return 0;
}