
/**
 * Закон Амдаля (Amdahl’s law) показує наскільки ми можемо прискорити програму за допомогою паралельних обчислень.
 *
 * P = 1 / (f + (1-f)/N)
 *
 * P — загальне прискорення програми (коефіцієнт, у скільки разів швидше вона виконається).
 * f — послідовна частина програми (ділянка коду, яку принципово не можна розпаралелити, виражена у вигляді дробу від 0 до 1).
 *     Примітка: іноді у літературі замість f пишуть просто S (serial), а паралельну частину позначають як p = 1 - f.
 * 1 - f — паралельна частина програми (те, що можна розділити між ядрами. Це логічно, бо якщо 1 це вся робота, і якщо
 *     від неї відняти те, що не можна розділити (f), то результатом буде те що розділити можна).
 * N — кількість процесорних ядер (або потоків).
 *
 * Тобто якщо весь код (всі задачі) можна паралелізувати (тобто послідовна частка дорівнює 0), тоді прискорення становить N.
 *
 * А якщо ми додамо нескінченну кількість ядер (N), то доданок (1 - f)/N прямуватиме до 0.
 * Формула набуде вигляду: P = 1/f
 * І тоді якщо у нас скажімо можна паралелізувати лише 10% коду, то максимальне теоретичне прискорення буде: P=1/0.1=10
 * Тобто навіть на 1000-ядерному суперкомп'ютері програма не працюватиме швидше, ніж у 10 разів.
 *
 *
 * І в реальному світі закон Амдаля постійно дає про себе знати, через такі фактори:
 *    1) Синхронізація (Mutexes, Locks): Коли потоки зупиняються і чекають на доступ до спільного ресурсу (std::mutex або std::shared_mutex),
 *       цей шматок часу перетворюється на послідовний (f). Забагато блокувань — і додавання нових ядер лише погіршить
 *       ситуацію через оверхед на перемикання контексту.
 *
 *    2) Точки входу та виходу: Зчитування файлу з диска (I/O), ініціалізація пулу потоків, збирання результатів докупи
 *       (наприклад, фінальний merge в алгоритмах сортування) — усе це послідовні кроки.
 *
 *
 *
 *
 *
 * У більшості обговорень продуктивності багатопотокового коду ми припускали, що потоки працюють «на повну потужність» і
 * завжди мають корисну роботу, коли вони виконуються на процесорі. Це неправда, у коді додатків потоки часто блокуються,
 * чекаючи на щось. Наприклад, вони можуть чекати завершення деяких операцій вводу-виводу, чекати на отримання м'ютекса,
 * чекати, поки інший потік завершить якусь операцію і повідомить про змінну умови або заповнить майбутнє, або навіть спати
 * протягом певного періоду часу.
 * І тут виходить проблема, що якщо у нас є антивірус який має 4 ядра, то 1 потік буде шукати назви файлів, решта 3 будуть
 * ці файли сканувати, але якщо файли великі, то більшість час буде йти на читання файлу з пам'яті і процесор буде простоювати,
 * тому тут доцільним буде збільшення кількості ядер, але теж до певної межі. Бо спочатку швидкодія може вирости, але потім
 * витрати на перемикання контексту навпаки почнуть сповільнювати роботу.
 *
 */

