
/**
 * Варіант підключення 2 - CMakeLists.txt сам завантажить бібліотеку з GitHub репозиторію.
 *
 * Будемо підключати просту бібліотеку nlohmann::json для роботи з JSON.
 * Ця бібліотека містить лише 1 .hpp файл
 *
 *
 * Цей варіант працює лише з CMakeLists.txt, CMake (починаючи з версії 3.11) вміє сам завантажувати бібліотеки
 * з GitHub під час першої конфігурації проєкту. Нам самим взагалі нічого не потрібно завантажувати на комп'ютер.
 *
 * У CMakeLists.txt ми включаємо цей функціонал і прописуємо адресу GitHub (або іншого) репозиторію.
 * Бібліотека завантажується у внутрішню директорію проєкту (cmake-build-debug/_deps)
 *
 * Такий варіант дозволяє всій команді працювати маючи однакову структуру внутрішньої директорії,
 * яку створює CMake
 */

#include <iostream>
#include <nlohmann/json.hpp> // <- Саме такий шлях! Не просто "json.hpp"

// Щоб не писати щоразу nlohmann::json, робимо зручний аліас:
using json = nlohmann::json;

int main() {
    // Створюємо JSON об'єкт прямо в коді
    json user;
    user["name"] = "Oleksandr";
    user["age"] = 21;
    user["skills"] = {"C++", "Systems Programming"};

    // Виводимо його на екран (гарно відформатованим у 4 відступи)
    std::cout << user.dump(4) << std::endl;

    return 0;
}