#include <iostream>
#include <thread>


void background_task() {
    for (int i{0}; i< 1000000000; i++) {

    }
    std::cout << "Hello from second thread\n";
}

int main() {
    // main у нас точка входу до основного потоку (thread), так працює C++

    std::thread my_thread {[]{
        background_task();
    }};
    /**
     * std::thread my_thread {background_task()}; - якби background_task щось повертало
     *
     * Можна передати у лямбда функції. В цьому випадку лямбда функція є точкою входу у thread
     * std::thread my_thread([]{
     *  do_something();
     *  do_something_else();
     * });
     */

    /**
     * Після запуску потоку потрібно чітко вирішити, чи чекати його завершення (об'єднавшись з ним — join()),
     * чи залишити його працювати самостійно (від'єднавши його — .detach()). Якщо ви не вирішите до того, як об'єкт std::thread
     * буде знищений, ваша програма буде завершена (деструктор std::thread викликає std::terminate()).
     *
     * Якщо ви не чекаєте, поки потік завершиться, вам потрібно переконатися, що дані, до яких звертається потік, є дійсними,
     * поки потік не завершить роботу з ними.
     *
     * Наприклад є функція яка запускається з головного потоку
     * my_func() {
     *  int x {0}'
     *  std::thread my_thread([] { some_func(x) })
     * }
     * Може статися так, що функція my_func буде знищена, а my_thread втратить доступ до локальної змінної x.
     * Саме тому треба щоб функція some_func приймала x не як pointer чи reference, а як копію, тоді проблем не буде.
     *
     */

    /*
     * Якщо вам потрібно дочекатися завершення потоку, ви можете зробити це, викликавши join() на пов'язаному екземплярі std::thread.
     * Тепер наш головний потік буде чекати доки my_thread не буде завершений. Тобто всі локальні змінні у main будуть доступні для my_thread,
     * і можна передавати їх як reference/pointer, але я б ліпше цього без потреби б не робив.
     *
     * Але оскільки наш головний thread чекає закінчення my_thread, то він нічого корисного не робить. Тобто After виведеться після роботи
     * my_thread. Я додав цикл для створення затримки.
     * Виклик join() також очищає будь-яке сховище, пов'язане з потоком, тому об'єкт std::thread більше не пов'язаний із потоком,
     * що завершився; він не пов'язаний з жодним потоком. Це означає, що ви можете викликати join() тільки один раз для даного потоку;
     * після виклику join() об'єкт std::thread більше не можна об'єднати, і joinable() поверне false.
     *
     * Не варто забувати що background_task може кинути exception, тож робити запуск thread варто у try...catch і якщо сталася
     * помилка, то теж викликати join() за потреби
     */
    // std::cout << "Before\n";
    // my_thread.join();
    // std::cout << "After\n";
    /**
     * Before
     * ...(some delay)
     * Hello from second thread
     * After
     */


    /**
     * Виклик detach() для об'єкта std::thread залишає потік працювати у фоновому режимі, без можливості прямого зв'язку з ним
     * Відокремлені потоки часто називають daemon threads за аналогією з концепцією UNIX про daemon process, який працює у
     * фоновому режимі без явного інтерфейсу користувача.
     * Такі потоки зазвичай працюють тривалий час; вони працюють майже протягом усього терміну дії програми, виконуючи фонові завдання,
     * такі як моніторинг файлової системи, очищення невикористаних записів з кеш-пам'яті об'єктів або оптимізація структур даних.
     * Після того як thread було від'єднано, то застосувати join() вже не можна і joinable() поверне false.
     *
     * detach доцільний у випадку коли у нас є програма редагування документа і кожна окреме вікно редагує свій документ, всі вікна працюють
     * в одній програмі, але у різних потоках (threads). І робота з одним документом ніяк не повинна впливати на роботу з іншим, тому
     * доцільно робити оброку кожного вікна у своєму thread і відповідно викликати detach
     *
     * void edit_document(std::string const& filename) {
     *  user_command cmd=get_user_input();
     *  if(cmd.type==open_new_document) {
     *      std::string const new_name=get_filename_from_user();
     *      std::thread t(edit_document,new_name);
     *      t.detach();
     *  }
     * }
     *
     * Якщо користувач вирішує відкрити новий документ, ви запитуєте його про документ, який потрібно відкрити, запускаєте
     * новий потік для відкриття цього документа, а потім від'єднуєте його
     */

    std::cout << "Before\n";
    my_thread.detach();
    std::cout << "is joinable: " << my_thread.joinable() << "\n"; // is joinable: 0 (тобто false)
    std::cout << "After\n";
    /**
     * Before
     * is joinable: 0
     * After
     *
     * Тобто вивід з my_thread не відбудеться бо наш головний thread виконав свою роботу і все, закрив термінал.
     * Якщо ми хочемо що вивід все ж відбувся, то треба не закривати наш thread. Якщо додамо
     * int x {0};
     * std::cin >> x;
     * То std::cin буде очікувати ввід від користувача і це дасть час my_thread допрацювати і вивести "Hello from second thread"
     */
    // int x {0};
    // std::cin >> x;



    return 0;
}