#include <iostream>
#include <memory>
#include <mutex>
#include <thread>


/**
 * Deadlock
 * Тепер уявіть, що у вас потоки сперечаються за блокування м'ютексов: кожна пара потоків повинна заблокувати обидва м'ютекси,
 * щоб виконати якусь операцію, і кожен потік має один м'ютекс і чекає на інший. Жоден потік не може продовжувати роботу,
 * оскільки кожен чекає, поки інший звільнить свій мьютекс. Цей сценарій називається тупиковою ситуацією, і це найбільша проблема,
 * пов'язана з необхідністю блокувати два або більше мьютексов для виконання операції.
 *
 *
 * Загальна порада для уникнення тупикової ситуації полягає в тому, щоб завжди блокувати два м'ютекси в одному і тому
 * ж порядку: якщо ви завжди блокуєте м'ютекс A перед м'ютексом B, то ви ніколи не потрапите в тупикову ситуацію. Іноді це просто,
 * оскільки м'ютекси служать різним цілям, але інколи це не так просто, наприклад, коли м'ютекси захищають окремі
 * екземпляри одного і того ж класу.
 *
 * На щастя, стандартна бібліотека C++ має рішення для цієї проблеми у вигляді std::lock — функції, яка може заблокувати
 * два або більше мьютексів одночасно без ризику виникнення deadlock
 *
 * Виклик std::lock() блокує два м'ютекси, і створюються два екземпляри std::lock_guard по одному для кожного м'ютекса.
 * Параметр std::adopt_lock надається на додаток до м'ютекса, щоб вказати об'єктам std::lock_guard, що м'ютекси
 * вже заблоковані, і вони повинні прийняти право власності на існуюче блокування на мьютекс, а не намагатися
 * заблокувати мьютекс в конструкторі. Це треба для того, щоб вони автоматично розблокувалися при виході з функції
 *
 * Якщо std::lock перший mutex заблокує, а на другому станеться помилка, то вона сам розблокує перший. Тобто тут працює
 * логіка або все або нічого.
 *
 * Це все можна зробити за допомогою шаблону std::scoped_lock guard(lhs.m, rhs.m); Все робиться в один рядок
 *
 *
 */

class Some_big_object {};
void swap(Some_big_object& lhs,Some_big_object& rhs);
class X {
private:
    Some_big_object some_detail;
    std::mutex m;
public:
    X(Some_big_object const& sd):some_detail(sd){}
    friend void swap(X& lhs, X& rhs) {
        if(&lhs==&rhs)
            return;
        std::lock(lhs.m,rhs.m);
        std::lock_guard<std::mutex> lock_a(lhs.m,std::adopt_lock);
        std::lock_guard<std::mutex> lock_b(rhs.m,std::adopt_lock);

        // std::scoped_lock guard(lhs.m, rhs.m); // Робить те саме що 3 рядки у верху, додано у С++17
        swap(lhs.some_detail,rhs.some_detail);
    }
};

/**
 * Deadlock виникає не тільки при блокуванні, хоча це найчастіша причина; ви можете створити зависання з двома потоками
 * і без блокування, якщо кожен потік викликає join() на об'єкті std::thread для іншого. У цьому випадку жоден потік не
 * може просуватися, оскільки чекає, поки інший закінчить.
 *
 */



void thread_func_A(std::thread& other_thread) {
    std::cout << "Thread A started. Waiting for Thread B to finish...\n";

    // Спроба почекати потік B.
    // Якщо потік B ще не завершився, A засинає тут назавжди.
    if (other_thread.joinable()) {
        other_thread.join();
    }

    std::cout << "Thread A finished!\n"; // Цей рядок ніколи не виконається
}

void thread_func_B(std::thread& other_thread) {
    std::cout << "Thread B started. Waiting for Thread A to finish...\n";

    // Спроба почекати потік A.
    // Оскільки A чекає на B, а B чекає на A — виникає Deadlock.
    if (other_thread.joinable()) {
        other_thread.join();
    }

    std::cout << "Thread B finished!\n"; // Цей рядок ніколи не виконається
}


int main() {

    std::thread t1, t2;
    // зараз t1 та t2 на .joinable() повернуть false

    // Ініціалізуємо їх так, щоб вони отримали посилання один на одного
    t1 = std::thread(thread_func_A, std::ref(t2));
    /**
     *  технічно t2 ще не ініціалізований потоком, і він може повернути false на joinable, але якщо буде хоче маленька затримка,
     *  яка у мені на машині відбулася, то наступний рядок встигне виконатися і joinable поверне true тож thread_func_A і thread_func_B
     *  запустять join і будуть вічно чекати
     */
    t2 = std::thread(thread_func_B, std::ref(t1));

    // Головний потік теж застрягне тут, бо t1 ніколи не завершиться
    t1.join();
    t2.join();


    /**
     * Thread B started. Waiting for Thread A to finish...
     * Thread A started. Waiting for Thread B to finish...
     */


    return 0;
}
