
/**
 * Варіант підключення 1 - напряму прописати шлях до бібліотеки у CMakeLists.txt.
 *
 * Будемо підключати просту бібліотеку nlohmann::json для роботи з JSON.
 * Ця бібліотека містить лише 1 .hpp файл
 *
 * Цей варіант підключення дуже простий, ми завантажили бібліотеку (один .hpp файл)
 * кудись на комп, нехай на C:/Libs/nlohmann_json і далі у CMakeLists.txt вказуємо
 * цей шлях у target_include_directories() функції.
 *
 * Цей варіант доволі простий, але має одне обмеження, це працює лише для однієї
 * людини, бо різні люди мають різні структури директорій і різні операційні системи,
 * де шляхи будуть відрізнятися. Тобто якщо ми працюємо через git і у нас бібліотека
 * лежить у різних директоріях, то таке рішення не спрацює.
 *
 * Також недоліком такого підходу є час компіляції. Коли ми пишемо #include "json.hpp" то код бібліотеки
 * вставляється у наш файл, і як тільки щось у цьому файлі зміниться, то треба буде перекомпілювати весь файл,
 * в тому числі із тим кодом, що вставився від бібліотеки. Для маленької бібліотеки це не проблема, але
 * якби у нас була велика бібліотека запхана в один .hpp файл і там було би 50 000 рядків коду то час
 * компіляції сильно би зріс
 */

#include <iostream>
#include "json.hpp" // Підключаємо файл, який лежить у тій же папці

// Щоб не писати щоразу nlohmann::json, робимо зручний аліас:
using json = nlohmann::json;

int main() {
    // Створюємо JSON об'єкт прямо в коді
    json user;
    user["name"] = "Oleksandr";
    user["age"] = 21;
    user["skills"] = {"C++", "Systems Programming"};

    // Виводимо його на екран (гарно відформатованим у 4 відступи)
    std::cout << user.dump(4) << std::endl;

    return 0;
}