
/**
 * Варіант підключення 2 з dynamic library - CMakeLists.txt сам завантажить бібліотеку з GitHub репозиторію.
 *
 * Будемо підключати просту бібліотеку fmtlib для форматування тексту.
 * Ця бібліотека містить не лише 1 .hpp файл, а кілька. І також вона має як static варіант, так і dynamic варіант.
 * Тут ми будемо працювати з dynamic варіантом і оскільки я роблю це на Windows, то будемо працювати з .dll файлами.
 *
 * По суті різниця між варіантом з одним .hpp файлом в тому, що ми додали
 *  set(BUILD_SHARED_LIBS ON)
 *
 * Тепер коли ми натиснемо кнопку Build, CMake зробить наступне:
 *  1) Завантажить сирці fmt.
 *  2) Скомпілює файл fmt.dll (або .so на Linux) і покладе його десь глибоко в надра директорії cmake-build-debug/_deps/....
 *  3) Скомпілює наш main.cpp у виконуваний файл project71_add_library_option_2_with_dynamic_lib.exe.
 *
 * Але коли ми натиснемо Run (Запуск), програма, швидше за все, впаде з помилкою: fmt.dll не знайдено.
 *
 * Windows шукає .dll файл поруч із нашим .exe файлом (або в системних папках).
 * Але FetchContent поклав згенерований .dll зовсім в іншу, службову папку CMake!
 * Зазвичай у проєктах для цього в CMakeLists.txt пишуть спеціальні скрипти автоматичного копіювання, я також такий додав,
 * він починається з if(WIN32)
 *
 */

#include <fmt/core.h>
#include <fmt/color.h>
#include <iostream>

int main() {
    // Просте форматування рядка
    std::string name = "Олексій";
    int age = 20;
    fmt::print("Привіт, {}! Тобі вже {} років.\n", name, age);

    // Магія fmt: виведення кольорового тексту в консоль!
    fmt::print(fg(fmt::color::crimson) | fmt::emphasis::bold,
               "Цей текст динамічно скомпілювався і став червоним!\n");

    std::cin.get(); // Wait for user input


    /**
     * Тільки треба запускати код не в терміналі від CLion, бо він не буде працювати як треба,
     * замість кольорів буде виводити спеціальні символи. Треба згенерувати .exe і запустити його,
     * тоді відкриється звичайний термінал із кольором.
     */
    return 0;
}