#include <iostream>
#include <thread>

void f(int i,std::string const& s) {

};

class MyClass {};
void update_data(int w, MyClass& data) {}
void process_widget_data(MyClass& data) {}


class X {
public:
    void do_lengthy_work(int a) {};
};

void process_big_object(std::unique_ptr<X> p);

int main() {
    /**
     * Передача аргументів
     *
     * std::thread спроектований так, щоб копіювати аргументи у власне внутрішнє сховище. Йому все одно що там за аргументи,
     * він буде копіювати все що зможе, а що не зможе, на те видасть помилку при компіляції!
     *
     * Якщо ви передаєте char*, конструктор потоку просто копіює адресу вказівника.
     *
     * У коді нижче функція f очікує параметр s як std::string, але у функції змінна buffer - це *char (бо при передачі буде decay array),
     * і компілятор сам приведе цю змінну до std::string, але оскільки в низу ми робимо detach ми можемо не встигнути
     * перетворити char на std::string і отримаємо dangling pointer
     *
     * std::thread t(f,3,buffer); - це у тред передається функція f і вона буде викликана з параметрами 3 і buffer
     *
     * Щоб цього уникнути можна зробити так
     * std::thread t(f,3,std::string(buffer));
     * ми одразу у передачі аргументів робимо правильний тип, тоді відбудеться копіювання параметрів уже з правильним типом
     *
     * У нашому випадку проблеми з передачею reference як у прикладі з std::ref не буде, бо s - це const&, а константні
     * посилання можуть прив'язуватися до тимчасових об'єктів (rvalues)
     */

    char buffer[1024];
    // В потік передається ПОКАЖЧИК (char*), а не об'єкт string
    // std::thread t(f,3,buffer);

    std::thread t(f,3,std::string(buffer));
    t.detach();


    /**
     * Проблема передачі по посиланню (std::ref)
     * Внутрішні механізми std::thread передають скопійовані аргументи як rvalues (тимчасові об'єкти).
     * C++ забороняє передавати тимчасові об'єкти у функції, які очікують не-const посилання (MyClass&).
     * Це захист: якби це спрацювало, функція змінила б копію всередині потоку, а не вашу оригінальну змінну data
     *
     * Тому код нижче не скомпілюється.
     * Рішення використати std::ref().
     * std::thread t(update_data, w, std::ref(data)); — це обгортка, яка каже потоку: "Не копіюй об'єкт, скопіюй обгортку яка є посиланням на нього".
     */
    MyClass data {};
    // std::thread t2(update_data, 1, data);  // std::thread скопіює 'data' у внутрішнє сховище
    std::thread t2(update_data, 1, std::ref(data));
    t2.join(); // Обов'язково чекаємо, бо ми захопили посилання на локальну змінну!
    process_widget_data(data); // якась обробка data після того, як update_data її змінила


    /**
     * Наведені вище приклади чудово показують особливість передачі аргументі у thread, але вони не дуже
     * читабельні, краще використовувати lambda, тому тут я наведу ті самі два приклади, але уже із lambda.
     *
     * У прикладі з MyClass нам не треба std::ref, бо раніше ми обманювали компілятор і він копіював std::ref, бо
     * він не може не копіювати. А з лямбдою все простіше, вона знає що ми передаємо reference.
     */

    // Ви відразу бачите, що s створюється як копія, і вона буде жити всередині лямбди, навіть коли buffer зникне.
    char buffer2[1024];
    std::thread t_3{[s=std::string(buffer2)] {
        f(3, s);
    }};
    t_3.detach();



    MyClass data2 {};
    std::thread t4([&data2] {
        update_data(1, data2);
    });
    t4.join(); // Обов'язково чекаємо, бо ми захопили посилання на локальну змінну!
    process_widget_data(data2); // якась обробка data після того, як update_data її змінила



    /**
     * Тепер розглянемо два більш складні приклади
     * 1) Передача метода класу
     * 2) Передача smart pointer
     *
     * Коли ви викликаєте звичайну функцію, ви просто передаєте її назву. Але метод класу (void X::do_lengthy_work())
     * завжди потребує об'єкт, на якому він буде викликаний (той самий this).
     * У std::thread синтаксис такий:
     *  - Перший аргумент: адреса методу класу (&X::do_lengthy_work).
     *  - Другий аргумент: адреса об'єкта, для якого цей метод викликається (&my_x).
     *  - Наступні аргументи: параметри, які приймає сам метод.
     */
    X my_x;
    int param {4};
    std::thread t5(&X::do_lengthy_work, &my_x, param);
    t5.join();

    // те саме, але через lambda
    std::thread t5_1([&my_x, param] {
        my_x.do_lengthy_work(param);
    });
    t5_1.join();



    /**
     * 2. Передача володіння (Move Semantics)
     * Є типи об'єктів, які не можна копіювати, бо вони "одноосібні власники" ресурсу. Найяскравіший приклад — std::unique_ptr.
     * Він гарантує, що на ділянку пам'яті вказує лише один smart pointer.
     *
     * Якщо ви спробуєте просто передати p у потік, програма не скомпілюється, бо std::thread спробує його скопіювати.
     * Рішення — std::move(): Функція std::move не переміщує дані сама по собі, вона лише каже компілятору: "Я дозволяю тобі
     * забрати (перемістити) ресурси з цього об'єкта в інший. Мені цей об'єкт більше не потрібен".
     */

    std::unique_ptr<X> p(new X);

    // std::move(p) спустошує локальний p і переносить вказівник усередину потоку
    std::thread t6(process_big_object, std::move(p));
    t6.detach();

    // те саме, але через lambda
    std::unique_ptr<X> p2(new X);
    std::thread t7([ptr = std::move(p2)]() mutable { // Створюємо нову змінну 'ptr' всередині лямбди, переміщуючи в неї 'p'
        process_big_object(std::move(ptr)); // Оскільки функція приймає не reference, а std::unique_ptr<X>, а smart pointer не можна копіювати треба зробити move ще раз
    });
    t7.detach();


    return 0;
}