#include <iostream>
#include <vector>

/**
 * Цей код створить аж три копії
 *  1) Копія в tmp
 *  2) коли копіюємо b у а (ми записуємо копію b у комірку пам'яті а буквально роблячи копію b)
 *  3) коли копіюємо tmp у b (ми записуємо копію tmp у комірку пам'яті b буквально роблячи копію tmp)
 *
 */

 template <typename T>
 void mySwapCopy(T& a, T& b) {
     T tmp { a }; // invokes copy constructor
     a = b; // invokes copy assignment b = tmp; // invokes copy assignment
 }

/**
 * В цьому прикладі використовується std::move для того, щоб перетворити L-Values на R-Values
 * і ми змогли застосувати переміщення.
 *
 * Коли tmp ініціалізується, замість створення копії x ми використовуємо std::move для перетворення змінної
 * L-Value x в R-Value. Оскільки параметр є R-Value, викликається семантика переміщення, і x переміщується в tmp.
 *
 */

template <typename T>
void mySwapMove(T& a, T& b) {
     T tmp { std::move(a) }; // invokes move constructor
     a = std::move(b); // invokes move assignment
     b = std::move(tmp); // invokes move assignment
 }

struct S {
     int x {};
 };

int main() {
    S s1 {1};
    S s2 {2};

    mySwapMove(s1, s2);

    // std::cout << s1.x << '\n'; // 2
    // std::cout << s2.x << '\n'; // 1



    // ******************** Приклад із масивом ********************
    std::cout << "**********************************************\n";
    /**
     * У першому випадку ми передали push_back() L-Value, тому для додавання елемента до вектора було використано семантику копіювання.
     * З цієї причини значення в str залишилося без змін.
     *
     * У другому випадку ми передали push_back() R-Value (фактично L-Value, перетворене за допомогою std::move), тому для додавання
     * елемента до вектора було використано семантику переміщення. Це є більш ефективним, оскільки елемент вектора може «викрасти»
     * значення рядка, а не копіювати його.
     */
    std::vector<std::string> v;

    // We use std::string because it is movable (std::string_view is not)
    std::string str { "Knock" };

    std::cout << "Copying str\n";
    v.push_back(str); // calls l-value version of push_back, which copies str into the array element

    std::cout << "str: " << str << '\n';
    std::cout << "vector: " << v[0] << '\n';

    std::cout << "\nMoving str\n";

    v.push_back(std::move(str)); // calls r-value version of push_back, which moves str into the array element

    std::cout << "str: " << str << '\n'; // print empty string - The result of this is indeterminate
    std::cout << "vector:" << v[0] << ' ' << v[1] << '\n';



    /**
     * Коли ми переміщуємо значення з тимчасового об'єкта, не має значення, яке значення залишається в об'єкті,
     * з якого було переміщено значення, оскільки тимчасовий об'єкт все одно буде негайно знищений. А що щодо об'єктів lvalue,
     * до яких ми застосували std::move()? Оскільки ми можемо продовжувати отримувати доступ до цих об'єктів після переміщення
     * їхніх значень (наприклад, у наведеному вище прикладі ми виводимо значення str після його переміщення), корисно знати,
     * яке значення в них залишається.
     *
     * Щодо цього, стандарт C++ говорить: «Якщо не зазначено інше, об'єкти moved-from [типів, визначених у стандартній бібліотеці C++]
     * повинні бути поміщені в коректний, але невизначений стан»
     *
     * У нашому прикладі вище, коли автор вивів значення str після виклику std::move, було виведено порожній рядок.
     * Однак це не є обов'язковим, і могло бути виведено будь-який дійсний рядок, включаючи порожній рядок, оригінальний
     * рядок або будь-який інший дійсний рядок. Тому слід уникати використання значення переміщеного об'єкта (на якому
     * застосували std::move), оскільки результати будуть залежати від конкретної реалізації.
     *
     *
     * std::move() дає компілятору підказку, що програміст більше не потребує значення об'єкта. Використовуйте std::move()
     * тільки для постійних об'єктів, значення яких ви хочете перемістити, і не робіть жодних припущень щодо значення об'єкта
     * після цього моменту. Можна надати переміщеному об'єкту нове значення (наприклад, за допомогою оператора = ) після
     * переміщення поточного значення.
     *
     * Де ще може бути корисним std::move?
     * std::move також може бути корисним при сортуванні масиву елементів. Багато алгоритмів сортування (таких як
     * selection sort і bubble sort) працюють шляхом обміну парами елементів.
     *
     */


    return 0;
}