#include <algorithm>
#include <future>
#include <list>
#include <vector>

/**
 * Найпростішими для паралелізації є прості алгоритми, такі як std::for_each, які виконують
 * операцію над кожним елементом у наборі даних.
 *
 * Ми можемо визначити певну кількість потоків і першому потоку дати N перших елементів списку,
 * другом потоку наступну порцію N і так далі. Це дуже потужна техніка, однак її не можна застосувати
 * до всього, адже бувають моменти, коли про дані які треба обробити ми дізнаємося лише в процесі виконання,
 * або ми просто не можемо чітко розділити дані одразу, наприклад як в алгоритмі QuickSort.
 *
 * Алгоритм Quicksort складається з двох основних етапів: вибору опорного елементу (pivot) та перерозподілу
 * менших значень у ліво, а більших у право. Потім повторюється рекурсивно для цих двох половин.
 * Ви не можете паралелізувати цей процес, розділивши дані заздалегідь, оскільки тільки після обробки елементів
 * ви дізнаєтеся, до якої «половини» вони належать.
 * Якщо ви хочете паралелізувати цей алгоритм, вам потрібно використовувати його рекурсивну природу.
 * З кожним рівнем рекурсії з'являється все більше викликів функції quick_sort, тому що вам потрібно сортувати як елементи,
 * що стоять перед опорним елементом, так і ті, що стоять після нього. Ці рекурсивні виклики є повністю незалежними,
 * тому що вони отримують доступ до окремих наборів елементів, і тому є ідеальними кандидатами для паралельного виконання.
 *
 *
 * Але тут виникає проблема, бо рекурсій може бути дуже багато і якщо на кожну з них робити окремий thread, то наша
 * програма почне працювати повільніше. Тому ми або можемо скористатися std::async або std::thread::hardware_concurrency()
 * який поверне кількість ядер, тож ми створимо лише стільки потоків, скільки у нас ядер і матимемо стек із завданнями,
 * і коли потік закінчив свою роботу він може піти у стек і безпечно взяти нову порцію даних для обробки.
 */


/**
 * Цей приклад наведено для розуміння, а не використання в реальному коді
 *
 * Опис змінних:
 *
 * chunk_to_sort — це опис одного завдання. Воно містить список даних, які треба відсортувати (data), та std::promise.
 * Останній потрібен, щоб потік, який виконає сортування, зміг «передати привіт» і повернути результат назад тому потоку, який це завдання створив.
 *
 * chunks — це глобальний сейф (стек), куди потоки скидають нові шматки роботи і звідки інші потоки їх витягують.
 * Оскільки він thread_safe_stack, потоки не заважають один одному. Він тут не реалізований, але уявимо що він працює.
 *
 * threads — пул фонових потоків, які ми створюємо в процесі.
 *
 * max_thread_count — обмеження, щоб не створити потоків більше, ніж ядер у процесора (hardware_concurrency() - 1).
 *
 * end_of_data — прапорець-атомік. Коли сортування завершено і викликається деструктор, він сигналізує фоновим потокам: «роботу закінчено, можна розходитися».
 *
 *
 * Опис алгоритму
 * Цей код реалізує принцип **«розділяй і володарюй»**, використовуючи пул потоків як помічників.
 *
 * 1. Головний потік** бере великий список даних, висмикує перший елемент (опорний) і швидко ділить решту списку на
 *      дві купки: зі значеннями меншими pivot та значеннями більшими за pivot.
 * 2. Замість того, щоб сортувати обидві купки самому, він пакує купку з «меншими» елементами у стек (`chunk`).
 * 3. Якщо у процесора є вільні ядра, код створює нові фонові потоки. Ці потоки постійно працюють у фоні:
 *    як тільки там з'являється нова порція даних у chunks, фоновий потік забирає її і починає сортувати за таким же принципом.
 * 4. Поки фоновий потік (можливо) сортує купку з меншими значеннями, а головний потік сам сортує купку з більшими.
 * 5. Коли головний потік закінчує свою роботу, йому потрібен результат від меншої купки. Він перевіряє: «Вже готово?».
 *    Якщо ні, він не спить, а йде у стек, бере звідти якесь інше чуже завдання і виконує його (щоб процесор не простоював даремно).
 *    Якщо ж так, він забирає готовий шматок, склеює його зі своїм і видає фінальний відсортований список.
 *
 *
 *
 * Цей підхід є спеціалізованою версією пулу потоків — це набір потоків, кожен з яких бере роботу зі списку очікуючих завдань,
 * виконує її, а потім повертається до списку за новою.
 */


template<typename T>
struct sorter {
    struct chunk_to_sort {
        std::list<T> data;
        std::promise<std::list<T>> promise;
    };
    thread_safe_stack<chunk_to_sort> chunks;
    std::vector<std::thread> threads;
    unsigned const max_thread_count;
    std::atomic<bool> end_of_data;
    sorter():
        max_thread_count(std::thread::hardware_concurrency()-1),
        end_of_data(false)
    {}

    ~sorter() {
        end_of_data=true;
        for(unsigned i=0;i<threads.size();++i) {
            threads[i].join();
        }
    }

    void try_sort_chunk() {
        std::shared_ptr<chunk_to_sort> chunk=chunks.pop();
        if(chunk) {
            sort_chunk(chunk);
        }
    }

    std::list<T> do_sort(std::list<T>& chunk_data) {
        if(chunk_data.empty()) {
            return chunk_data;
        }
        std::list<T> result;
        /**
         * Метод splice є унікальною фішкою двозв'язного списку std::list у C++. Він призначений для того, щоб
         * переміщати елементи з одного списку в інший без копіювання та без видалення об'єктів.
         */
        result.splice(result.begin(),chunk_data,chunk_data.begin());
        T const& partition_val=*result.begin();

        /**
         * std::partition розділяє наші дані на дві купки: менші за опорний елемент та більші або рівні йому.
         * divide_point вказує на перший елемент другої групи (тобто на перший елемент, який став більшим або рівним за опорний).
         */
        typename std::list<T>::iterator divide_point =
            std::partition(chunk_data.begin(),chunk_data.end(),
                           [&](T const& val){return val<partition_val;});

        // Вставляємо (переносимо) у new_lower_chunk всі елементи які менше pivot (тобто divide_point)
        chunk_to_sort new_lower_chunk;
        new_lower_chunk.data.splice(new_lower_chunk.data.end(), // 1. Куди вставити
                                    chunk_data,              // 2. Звідки взяти
                                    chunk_data.begin(),         // 3. З якого елемента почати перенесення
                                    divide_point);          // 4. Перед яким елементом зупинитися

        // Беремо у new_lower_chunk future, щоб потім забрати по ньому результат роботи у потока
        std::future<std::list<T>> new_lower = new_lower_chunk.promise.get_future();
        // Закидаємо new_lower_chunk за допомогою move у загальний стек chunks. Тепер будь-який вільний потік може його звідти взяти.
        chunks.push(std::move(new_lower_chunk));

        // Якщо у нас ще є вільні процесорні ядра (threads.size() < max_thread_count), ми створюємо новий потік sort_thread і
        // додаємо його в наш пул, щоб він допоміг розгрібати завдання.
        if(threads.size() < max_thread_count) {
            threads.push_back(std::thread(&sorter<T>::sort_thread,this));
        }

        /**
         * Поки інші потоки (можливо) зайняті лівою частиною, поточний потік не сидить склавши руки. Він бере залишок
         * chunk_data (де лежать більші елементи) і сортує їх сам, рекурсивно викликаючи do_sort(chunk_data).
         * Результат (new_higher) він приклеює в кінець result.
         */
        std::list<T> new_higher(do_sort(chunk_data));
        result.splice(result.end(),new_higher);

        /**
         * Через wait_for(0) потік миттєво перевіряє: «Ліву частину вже відсортували? Ні? Тоді я сам візьму якесь інше
         * завдання зі стеку (try_sort_chunk()), щоб не втрачати час!». Це запобігає простою процесора.
         */
        while(new_lower.wait_for(std::chrono::seconds(0)) != std::future_status::ready) {
            try_sort_chunk();
        }
        result.splice(result.begin(),new_lower.get());
        return result;
    }

    void sort_chunk(std::shared_ptr<chunk_to_sort > const& chunk) {
        chunk->promise.set_value(do_sort(chunk->data));
    }

    /**
     * sort_thread — це нескінченний цикл фонового потоку. Він крутиться, поки живий об'єкт sorter (!end_of_data).
     * Він постійно смикає try_sort_chunk(), а якщо роботи немає, робить yield() — поступається часом процесора
     * іншим програмам, щоб не перегрівати комп'ютер даремно. Тобто кожен створений нами потік в do_sort запустив
     * цю функцію і тепер постійно тягне дані для сортування із стеку chunks у функції try_sort_chunk.
     */
    void sort_thread() {
        while(!end_of_data) {
            try_sort_chunk();
            std::this_thread::yield();
        }
    }
};


template<typename T>
std::list<T> parallel_quick_sort(std::list<T> input) {
    if(input.empty()) {
        return input;
    }
    sorter<T> s;
    return s.do_sort(input);
}


/**
 * Інші підходи до паралелізму
 *
 * Розподіл роботи між потоками шляхом виділення різних блоків даних для кожного потоку (заздалегідь або рекурсивно під
 * час обробки) все ще базується на припущенні, що потоки будуть виконувати однакову роботу над кожним блоком даних.
 * Альтернативою розподілу роботи є створення спеціалізованих потоків, де кожен виконує окреме завдання.
 *
 * Це такий вид розподілу роботи, який є результатом розділення завдань з урахуванням паралельності; кожен потік має
 * окреме завдання, яке він виконує незалежно від інших потоків.
 *
 * Це може бути зручно, коли один потік відповідає за отримання інформації про натиснуті клавіші, інший робить бізнес логіку,
 * третій надсилає дані по мережі.
 *
 * Але у такого підходу є недолік, коли ми даємо завдання потоку він повинен повідомити нам про результат.
 * І недоліком може бути якщо два потоки мають передавати великі дані між собою, або дуже часто невеликі дані.
 * В цих випадках можливо доцільно їх об'єднати в один потік.
 *
 * Конвеєр
 * Нехай у нас є 20 елементів 4 потоки і кожен потік опрацьовує елемент 3 секунди. Отже якщо всі 4 потоки працюють паралельно,
 * то за перші 12 секунд ми обробимо 16 елементів, а 20 за 15 секунд. Але якщо ми будемо запускати потоки послідовно, перший
 * потік робить лише свою частину і віддає другому, той віддає третьому, а той четвертому. Тож час роботи буде трохи довший,
 * бо на першому елемент четвертий потік буде чекати доки три попередні відпрацюють і дадуть йому дані. Але в деяких випадках
 * це краще. Уявимо перегляд фільму.
 * Щоб відео можна було переглядати, зазвичай потрібно щонайменше 25 кадрів на секунду, а в ідеалі — більше. Крім того,
 * глядачеві потрібно, щоб вони були рівномірно розподілені, щоб створити враження безперервного руху; програма, яка може
 * декодувати 100 кадрів на секунду, все одно буде марною, якщо вона зупиняється на секунду, потім відображає 100 кадрів,
 * потім зупиняється ще на секунду і відображає ще 100 кадрів. З іншого боку, глядачі, ймовірно, з радістю погодяться на
 * затримку в кілька секунд, коли починають перегляд відео. У цьому випадку, ймовірно, краще використовувати паралелізацію
 * за допомогою конвеєра, який виводить кадри з рівномірною швидкістю.
 */
int main() {


    return 0;
}