#include <iostream>
#include <thread>
#include <vector>

void some_function() {};
void some_other_function() {};

/**
 * Завдяки Move-семантиці, потоки дуже легко "перекидати" між функціями.
 * Повернення з функції: Ви створюєте потік всередині, а "керування" ним віддаєте тому, хто викликав функцію.
 * Тут std::move використовувати не треба, компілятор все зробиться сам
 */
std::thread f() {
    return std::thread(some_function); // Володіння вилітає назовні
}

void g(std::thread tr){
    tr.detach();
}




class Scoped_thread {
    std::thread t;
public:
    explicit Scoped_thread(std::thread t_) : t(std::move(t_)) { // Забираємо потік собі
        if(!t.joinable()) throw std::logic_error("No thread");
    }
    ~Scoped_thread() {
        t.join(); // Завжди чекаємо завершення
    }
    // Забороняємо копіювання, щоб не було дублікатів
    Scoped_thread(Scoped_thread const&)=delete;
    Scoped_thread& operator=(Scoped_thread const&)=delete;
};


void do_work(unsigned id) {};

int main() {
    /**
     * Припустимо, ви хочете написати функцію, яка створює потік для виконання у фоновому режимі, але передає право
     * власності на новий потік назад функції, що викликає, замість того, щоб чекати його завершення;
     * або, можливо, ви хочете зробити навпаки: створити потік і передати право власності деякій функції, яка повинна чекати
     * його завершення. У будь-якому випадку вам потрібно передати право власності з одного місця в інше.
     *
     *
     * Якщо ви намагаєтеся присвоїти новий потік об'єкту, який вже володіє активним потоком,
     * програма негайно завершиться аварією (std::terminate()).
     * C++ вимагає, щоб ви явно вирішили долю кожного потоку: або join() (чекати), або detach() (відпустити).
     * Ви не можете просто "викинути" потік, призначивши змінній нове значення.
     */

    std::thread t1(some_function); // t1 володіє потоком А
    std::thread t2=std::move(t1); // t1 стає порожнім, t2 володіє потоком А
    t1=std::thread(some_other_function); // t1 автоматично забирає володіння у тимчасового об'єкта (потік Б)
    std::thread t3;
    // t3=std::move(t2);
    // t1=std::move(t3); // Викличеться std::terminate(), бо t1 вже тримав потік Б
    t1.detach();
    t2.detach();



    // Передача у функцію: Функція приймає потік і стає відповідальною за нього (має зробити join або detach).
    std::thread my_thread (some_function);
    g(std::move(my_thread)); // Тепер функція g відповідає за потік


    // Компілятор сам перемістить потік у змінну t
    std::thread t4 = f();
    t4.detach();

    /**
     * Чим scoped_thread хороший?
     *  Повне володіння: Коли ви передаєте потік у scoped_thread, оригінальна змінна стає порожньою.
     *  Ніхто інший не зможе випадково зробити join чи detach.
     *
     *  Гарантований join: Деструктор автоматично робить join(). Ви не забудете про це.
     *
     *  Перевірка в конструкторі: Ми відразу перевіряємо, чи нам дали "живий" потік.
     */
    Scoped_thread st{std::thread(some_function)};

    /**
     * std::jthread (введений у C++20) — це фактично стандартизована та покращена версія того самого scoped_thread
     *
     *  1. Автоматичний Join
     *      Головна фішка scoped_thread була в тому, щоб автоматично викликати join() у деструкторі. std::jthread робить це "з коробки".
     *      Якщо об'єкт std::jthread виходить з області видимості, він не обвалить програму (як це робить std::thread),
     *      а дочекається завершення потоку.
     *
     *  2. Вбудована підтримка зупинки (Cooperative Interruption)
     *      Це те, чого не було в scoped_thread. std::jthread вміє передавати в потік спеціальний токен зупинки (std::stop_token).
     *      Це дозволяє елегантно попросити потік завершитися, а не просто чекати його.
     *
     *
     * Варто завжди використовувати jtread окрім одного випадку
     * Якщо тобі дійсно потрібно, щоб потік жив сам по собі ("fire and forget") після завершення батьківської функції,
     * std::jthread тобі заважатиме, бо він обов'язково зробить join(). В такому разі або використовуй std::thread з detach(),
     * або викликай t.detach() у самого jthread
     */


    /**
     * Основа для паралельних алгоритмів
     *
     * Оскільки std::thread підтримує переміщення (move), ми можемо зберігати ці об'єкти в контейнерах, наприклад у std::vector
     *
     * std::thread не можна копіювати. Раніше це було проблемою для контейнерів. Але сучасний std::vector "розуміє" семантику переміщення.
     *
     * Коли ми робимо threads.emplace_back(do_work, i):
     *  1. Вектор виділяє пам'ять під новий об'єкт std::thread.
     *  2. Потік створюється безпосередньо "всередині" вектора.
     *  3. Якщо вектору потрібно розширитися (переїхати в іншу ділянку пам'яті), він не копіює потоки,
     *     а переміщує їх (move) на нове місце. Це дозволяє зберігати контроль над фізичними потоками.
     *
     * Цикл створює 20 потоків, кожен з яких виконує свою частину роботи (do_work). Вони працюють одночасно.
     * Другий цикл проходить по вектору і викликає join() для кожного об'єкта. Головна функція f() не завершиться,
     * поки останній із 20 потоків не закінчить роботу.
     */

    std::vector<std::thread> threads;
    for (unsigned int i{0}; i<20; ++i) {
        threads.emplace_back(do_work, i);
    }
    for (auto& tread : threads) {
        tread.join();
    }



    /**
     * Thread ID
     *
     * Кожен thread у C++ має свій унікальний ідентифікатор, щоб дізнатися можна використати .get_id()
     * Або якщо вас цікавить потік у якому ви зараз то можна std::this_thread::get_id()
     *
     * Для чого воно треба
     *  1) Розподіл ролей (Master/Worker)
     *  Ви можете зберегти ID головного потоку (master_thread) і в спільній функції перевіряти:
     *  "Якщо я — головний потік, я роблю специфічну роботу, інакше — звичайну"
     *  if(std::this_thread::get_id() == master_thread) {
     *      do_master_work(); // Тільки для боса
     *  }
     *
     *  Б. Асоціативні контейнери
     *  Ви можете створити словник, де ключем буде ID потоку, а значенням — якісь дані, що належать тільки йому.
     *  Це альтернатива thread_local сховищам, коли вам потрібно керувати даними ззовні.
     */
    std::thread t5([]{});
    std::cout << t5.get_id() << '\n'; // 27
    t5.detach();

    std::cout << std::this_thread::get_id() << '\n'; // 1

    return 0;
}
