
/**
 * Ця нотатка містить кілька файлів які поступово покращують реалізацію thread pool.
 *
 * 1. step1_simple_pool.cpp - базова реалізація thread pool
 * 2. step2_future_pool.cpp - реалізація яка дозволяє повертати результати з потоків і чекати на їх
 *                            виконання завдяки future
 * 3. step3_local_queues.cpp - додано локальні черги у кожен потік, щоб вони всі не стукалися у глобальну
 *                             чергу і не блокували одне одного (актуально при великій кількості потоків,
 *                             або при дуже маленьких задачах на один потік)
 * 4. step4_work_stealing.cpp - покращена версія step3_local_queues.cpp, яка виправляє помилку, що всі
 *                              задачі можуть опинитися в одному потоці, і інші потоки б нічого не робили.
 *
 * Оскільки тут не стоїть задачі писати робочий код, то деякі моменти свідомо не реалізовані, до прикладу
 * thread_safe_queue не реалізована, оскільки її реалізація є в попередніх нотатка.
 * Нотатка описує розділ книги C++ Concurrency in Action, розділ 9.1
 */

int main() {

    return 0;
}
