
/**
 * Static and dynamic libraries
 *
 * library у C++ зазвичай складається з двох частин:
 *      header - файл, що визначає функціональність, яку бібліотека надає програмам
 *      precompiled binary - містить реалізацію цієї функціональності, попередньо скомпільовану машинною мовою
 *
 * Деякі бібліотеки можуть містити все в одному header файлі, а деякі мають багато header та .cpp файлів.
 *
 * Бібліотеки надаються precompiled (попередньо скомпільованими) з кількох причин.
 *      По-перше, оскільки бібліотеки рідко змінюються, їх не потрібно часто перекомпілювати.
 *      Було б марною тратою часу перекомпілювати бібліотеку щоразу, коли ви пишете програму, яка їх використовує.
 *
 *      По-друге, оскільки попередньо скомпільовані об'єкти написані машинною мовою, це унеможливлює доступ до
 *      вихідного коду або його зміну, що є важливим для підприємств або осіб, які не бажають надавати доступ до
 *      свого вихідного коду з міркувань інтелектуальної власності.
 *
 * Існує два види бібліотек:  static libraries та dynamic libraries.
 *      - static library (також відома як archive (архів)) складається з підпрограм, які компілюються та
 *        безпосередньо зв'язуються з вашою програмою.
 *        На Windows, static libraries зазвичай мають розширення .lib, в той час, як на Linux .a (від слова archive)
 *        Однією з переваг static library є те, що достатньо лише розповсюдити виконуваний файл, щоб користувачі могли
 *        використовувати цю бібліотеку. Оскільки статичні бібліотеки стають частиною вашої програми, ви можете
 *        використовувати їх так само як і функціональність, яку ви написали для власної програми.
 *
 *        Недоліком є те, що овни можуть займати зайве місце і їх важко оновити, треба видалити і встановити наново нову версію.
 *
 *      - dynamic library (також їх називають shared library) складається з підпрограм, які завантажуються у вашу
 *        програму під час виконання (runtime). Коли ви компілюєте програму, яка використовує динамічну бібліотеку,
 *        бібліотека не стає частиною вашого виконуваного файлу — вона залишається окремою одиницею.
 *        На Windows, dynamic libraries зазвичай мають розширення .dll (dynamic link library), в той час, як на
 *        Linux мають розширення .so (shared object).
 *        Перевагою такого підходу є те, що різні програму можуть використовувати одну бібліотеку, і не містити її
 *        в собі і тим самим економити місце. Також великою перевагою є те, що динамічну бібліотеку можна оновити
 *        до новішої версії без заміни всіх виконуваних файлів, які її використовують.
 *
 *
 *        Бібліотека імпорту (import library) — це бібліотека, яка автоматизує процес завантаження та використання
 *        динамічної бібліотеки.
 *
 *        На Windows, це зазвичай реалізовано через невелику static library (статичну бібліотеку) (.lib) з такою ж назвою,
 *        як і dynamic library (динамічна бібліотека) (.dll). Статична бібліотека підключається до програми на етапі
 *        компіляції, після чого функціонал динамічної бібліотеки можна ефективно використовувати так, ніби це статична бібліотека.
 *
 *        У Linux файл спільного об'єкта (shared object) (.so) виконує роль як динамічної бібліотеки, так і бібліотеки
 *        імпорту. Більшість лінкерів можуть створювати бібліотеку імпорту для динамічної бібліотеки під час її формування.
 *
 * Installing and using libraries
 * Встановлення бібліотеки у C++ зазвичай включає 4 етапи:
 *      1) Отримання бібліотеки. Найкращим варіантом буде встановлення precompiled версії для нашої операційної системи.
 *         Тоді не буде потреби компілювати бібліотеку самому. Якщо для нашої системи не буде precompiled версії, то
 *         тоді треба буде завантажити source code і скомпілювати самому.
 *         На Windows, бібліотеки зазвичай розповсюджуються як .zip файли.
 *         На Linux, бібліотеки зазвичай розповсюджуються як пакети (packages) (e.g. .RPM).
 *
 *      2) Встановлення (Install) library.
 *         На Linux, це зазвичай включає виклик package manager і він робить всю роботу.
 *         На Windows, це зазвичай включає розпаковку бібліотеки (unzipping the library) у директорію на наш вибір.
 *         Рекомендується тримати всі бібліотеки в одному місці, наприклад в C:\Libs
 *
 *      3) Треба впевнитися, що компілятор знає де шукати header file для бібліотеки.
 *         На Windows, зазвичай це включає піддиректорії директорії, де встановлено файли бібліотеки (наприклад, якщо
 *         ми встановили бібліотеку в C:\libs\SDL-1.2.11, то header файли імовірно будуть у C:\libs\SDL-1.2.11\include).
 *
 *         На Linux, header файли зазвичай встановлені в /usr/include, яка вже повинна бути частиною нашого file search path.
 *         Однак, якщо файли встановлені в іншому місці, ми повинні сказати компілятору де їх знайти.
 *
 *      4) Сказати лінкеру (linker) де шукати файли бібліотеки.
 *         Як і у кроці 3, це зазвичай включає додавання директорії до списку в якому лінкер шукає бібліотеки.
 *         На Windows, це зазвичай /lib піддиректорія директорії куди ми встановили бібліотеку
 *         На Linux, бібліотеки зазвичай встановлюються в /usr/lib, який вже повинен бути частиною нашої library search path.
 *
 *
 * Після встановлення бібліотеки, IDE знає, де її шукати. Зазвичай для кожного проєкту, який хоче використовувати бібліотеку,
 * потрібно виконати наступні 3 кроки:
 *      5) Якщо використовуємо static libraries або import libraries, сказати лінекру (linker) які файли бібліотеки прилінкувати
 *      6) Додати #include header фалу (файлів) бібліотеки у нашу програму. Це скаже компілятору про функціональність яку надає
 *         бібліотека, про всі її класи та файли, щоб наша програма не зламалася допоки вони не підтягнулися.
 *      7) Якщо використовуються dynamic libraries, треба впевнитися, що програма знає де їх знайти.
 *         У Linux бібліотеки зазвичай встановлюються до /usr/lib, який знаходиться у шляху пошуку за замовчуванням
 *         після шляхів у змінній середовища LD_LIBRARY_PATH.
 *
 *         У Windows шлях пошуку за замовчуванням включає каталог, з якого запускається програма, каталоги, встановлені
 *         викликом SetDllDirectory(), каталоги Windows, System та System32, а також каталоги у змінній середовища PATH.
 *
 *
 *         Найпростіший спосіб використовувати DLL-файл – це скопіювати його до місця розташування виконуваного файлу.
 *         Оскільки зазвичай DLL-файл поширюється разом із виконуваним файлом, має сенс зберігати їх разом.
 *
 *
 * Далі у проєктах я наводжу три різних способи підключити бібліотеки:
 *  1) Напряму прописати шлях у CMakeLists.txt
 *  2) Через новий функціонал CMake FetchContent у CMakeLists.txt
 *  3) Через пакетний менеджер vcpkg або conan або інший і підключення у CMakeLists.txt
 */
