#include <iostream>

class A {
private:
    int m_x;
public:
    A(int x) : m_x{x} {
        if (x <= 0)
            throw 1; // Exception thrown here
    }
};

class B : public A {
public:
    B(int x) : A{x} {

    }
};

//--------------------------------------------------------------


class A1 {
private:
    int m_x;
public:
    A1(int x) : m_x{x} {
        if (x <= 0)
            throw 1; // Exception thrown here
    }
};

class B1 : public A1 {
public:
    B1(int x) try: A1{x} {

    } catch (...) {
        std::cout << "Exception caught in B\n";
        throw; // rethrow the existing exception
    }
};


int main() {
    /**
     * У цьому випадку exception стається у конструкторі класу A який викликається з конструктора
     * класу B. І ми відловимо помилку вже у main.
     */
    try {
        B b{0};
    } catch (int) {
        std::cout << "Oops\n";
    }
    // Виведе у термінал Oops

    /**
     * А що якщо я хочу відловити помилку ще у класі B? Як мені додати обробку помилок
     * на конструктор? Все дуже просто, можна вставити блок try ще до ініціалізації констант
     * чи виклику інших конструкторів і так відловити помилку.
     */
    try {
        B1 b{0};
    } catch (int) {
        std::cout << "Oops\n";
    }
    /**
     * Виведе у термінал
     * Exception caught in B
     * Oops
     */


    /**
     * На відміну від конструкторів, де викидання винятків може бути корисним способом вказати, що створення об'єкта не вдалося,
     * винятки ніколи не слід викидати в деструкторах.
     *
     * Проблема виникає, коли під час розгортання стека з деструктора генерується виняток. У такому випадку компілятор
     * опиняється в ситуації, коли він не знає, чи продовжувати розгортання стека, чи обробляти новий виняток.
     * У результаті ваша програма буде негайно припинена.
     *
     * Отже, найкращим варіантом дій буде взагалі утриматися від використання винятків у деструкторах.
     * Натомість записувати повідомлення у файл журналу.
     *
     */

}