#include <fstream>
#include <iostream>
#include <string>


/**
 * The file pointer
 * Кожен file stream class містить покажчик (pointer) файлу, який використовується для відстеження поточної позиції читання/запису у файлі.
 * Коли з файлу щось читається або до нього щось записується, читання/запис відбувається у місці, де саме знаходиться покажчик (pointer) файлу.
 * За замовчуванням, під час відкриття файлу для читання або запису, покажчик (pointer) встановлюється на початок файлу.
 * Однак, якщо файл відкрито в режимі додавання, покажчик (pointer) переміщується на кінець файлу, щоб запис не перезаписував поточний вміст файлу.
 *
 * Random file access with seekg() and seekp()
 * У попередньому прикладі ми читали файл послідовно, однак бувають моменти коли у файлі багато даних і немає сенсу читати все,
 * треба лише перейти в потрібне місце і прочитати невеликий шматок даних, а потім перейти в інше місце і прочитати там.
 *
 * Довільний доступ до файлу реалізовано через маніпуляцію покажчика (pointer) функціями seekg() (для input) та seekp() (для output).
 * Для деяких типів streams функції seekg() (зміна позиції читання) та seekp() (зміна позиції запису) працюють незалежно одна від одної;
 * однак у випадку файлових streams позиції читання та запису завжди збігаються, тому функції seekg() та seekp() можна використовувати як взаємозамінні.
 *
 *
 * Функції seekg() та seekp() приймають два параметри. Перший параметр – це зсув, який визначає, на скільки байтів потрібно перемістити вказівник файлу.
 * Другий параметр – це прапорець iOS, який вказує, відносно чого має бути зміщений параметр зсуву.
 *
 * beg - The offset is relative to the beginning of the file (default)
 * cur - Зсув визначається відносно поточного розташування покажчика (pointer) файлу
 * end - Зсув визначається відносно кінця файлу
 *
 * Додатне зміщення означає переміщення вказівника файлу до кінця файлу, тоді як від'ємне зміщення означає
 * переміщення вказівника файлу до початку файлу.
 *
 *
 */

void example() {
    std::ifstream inf{ "res/Sample2.txt" };

    // If we couldn't open the input file stream for reading
    if (!inf) {
        std::cerr << "Uh oh, Sample2.txt could not be opened for reading!\n";
        return;
    }

    std::string strData;

    inf.seekg(5); // move to 5th character
    // Get the rest of the line and print it, moving to line 2
    std::getline(inf, strData);
    std::cout << strData << '\n'; // is line 1

    inf.seekg(8, std::ios::cur); // move 8 more bytes into file
    // Get rest of the line and print it
    std::getline(inf, strData);
    std::cout << strData << '\n'; // ne 2

    inf.seekg(-14, std::ios::end); // move 14 bytes before end of file
    // Get rest of the line and print it
    std::getline(inf, strData); // This is line 4 (undefined behavior)
    std::cout << strData << '\n';

    /**
     * Мій результат
     * is line 1
     * ne 2
     * This is line 4
     *
     * Але результат на іншій машині може відрізнятися
     */
}

void get_file_size_in_bytes() {
    std::ifstream inf {"res/Sample2.txt", std::ifstream::binary};
    inf.seekg(0, std::ios::end); // move to end of file
    std::cout << inf.tellg(); // показує поточну позицію курсора - На моїй машині виведе 62

    // Тобто розмір "Sample.txt" (разом із переходами на новий рядок) буде 62 bytes
    // Якби цей файл було створено Unix (Linux/macOS) це значення відрізнялося
}

void replace_all_vowel_character() {
    // Ми маємо вказати обидва прапорці in та out оскільки ми працюємо з fstream і хочемо як читати так і записувати
    std::fstream iofile{ "res/Sample3.txt", std::ios::in | std::ios::out | std::ios::binary};
    /**
     * Додати std::ios::binary ДУЖЕ важливо, бо інакше на Windows у мене видавав на цей код таке:
     * This #s line#1
     * This#is#lin# 2
     * Thi# i# li#e#3
     * Th#s #s l#n# 4
     *
     * І це було тому що, на Windows новий рядок пишеться через \r\n, і це 2 byte, але С++ чи компілятор чи редактор
     * переводять \r\n в один символ \n - а це 1 byte і у нас йдк збій.
     * Може з'явитися питання, а чому помилка виникла вже на першому This, якщо мала б виникнути в кінці рядка через +1 байт?
     * Вся суть у команді
     *  iofile.seekg(iofile.tellg(), std::ios::beg);
     *
     * Розглянемо покроково що відбувається:
     *  - Знайшли літеру 'i'.
     *  - Зробили крок назад (seekg(-1)), записали #. Курсор став перед літерою 's'.
     *  - Викликали «скидання буфера»: iofile.seekg(iofile.tellg(), std::ios::beg).
     *      iofile.tellg() повертає не номер байта (і не номер біта), а велике, складне системне число-маркер,
     *      яке генерує Windows. Коли ви передаєте це складне число в seekg(..., std::ios::beg), Windows намагається
     *      розшифрувати його назад у позицію, але через внутрішній баг текстового буфера прораховується.
     *  - Наступний цикл зчитує вже не те, що треба, і весь файл «пливе».
     *
     * Прапорець std::ios::binary
     * У Windows перенесення рядка фізично складається з двох байтів: \r та \n.
     * У текстовому режимі: C++ зчитує ці два байти, але об'єднує їх в один символ \n. Через це для вас у коді це 1 символ, а на диску — 2 байти.
     * У бінарному режимі: C++ повністю вимикає це об'єднання. Він бачить файл «голим» — як пряму послідовність байтів на диску.
     * \r — це окремий байт, \n — окремий байт.
     *
     */

    // If we couldn't open iofile, print an error
    if (!iofile) {
        std::cerr << "Uh oh, Sample3.txt could not be opened!\n";
        return;
    }

    /**
     * chChar прийме один байт, але що буде якщо у файлі будуть українські літери (і,я ф), адже вони за'матимуть 2 байти.
     * А японські ієрогліфи можуть займати 3 чи 4 байти, тоді у chChar потрапить лише один з байтів, а наступний
     * потрапить туди при наступній ітерації. Тобто цілком можливо що chChar міститиме не цілий символ, а лише його третину.
     * Оскільки в нашому прикладі ми працюємо з латинським алфавітом, то там всі символи займають 1 байт, то все буде ок.
     */
    char chChar{}; // Сюди ми будемо записувати кожен символ по одному

    // Цикл працює допоки ми можемо отримати символ (байт)
    while (iofile.get(chChar)) {
        switch (chChar) {
        // Якщо літера голосна
        case 'a':
        case 'e':
        case 'i':
        case 'o':
        case 'u':
        case 'A':
        case 'E':
        case 'I':
        case 'O':
        case 'U':

            // Повертаємося на 1 символ назад
            iofile.seekg(-1, std::ios::cur);

            // Оскільки ми повернулися на 1 символ назад, то якщо ми зараз щось впишемо, то замінимо наступний
            iofile << '#';

            // Тепер ми перейдемо у reading mode, щоб зчитати наступний символ при наступній ітерації циклу.
            // Для цього ми робимо переміщення курсора, в нашому випадку переміщаємо його туди де він і був
            iofile.seekg(iofile.tellg(), std::ios::beg);

            break;
        }
    }

    /**
     * У результаті на початку у файлі такий вміст:
     * This is line 1
     * This is line 2
     * This is line 3
     * This is line 4
     *
     * А після запуску такий:
     * Th#s #s l#n# 1
     * Th#s #s l#n# 2
     * Th#s #s l#n# 3
     * Th#s #s l#n# 4
     *
     *
     */
}


/**
 * Важливе зауваження для роботи з файлами, у мене є тека res, де лежать всі .txt файли з якими
 * ми тут працюємо, завдяки команді у CMakeLists.txt ця тека копіюється у cmake-build-debug або у
 * cmake-build-release. І саме файли у цих двох теках і будуть зчитуватися і змінюватися під час
 * запуску файлу (технічно .exe файлу). А ті що лежать в корені чіпатися не будуть, тому не варто
 * дивитися в них зміни після запуску коду.
 */
int main() {
    std::ifstream inf { "res/Sample.txt" };

    inf.seekg(14, std::ios::cur); // move forward 14 bytes
    inf.seekg(-18, std::ios::cur); // move backwards 18 bytes
    inf.seekg(22, std::ios::beg); // move to 22nd byte in file
    inf.seekg(24); // move to 24th byte in file
    inf.seekg(-28, std::ios::end); // move to the 28th byte before end of the file


    // Що перейти на початок або на кінець файлу достатньо цього
    inf.seekg(0, std::ios::beg); // move to beginning of file
    inf.seekg(0, std::ios::end); // move to end of file


    /**
     * ВАЖЛИВО!
     * У текстовому файлі пошук до позиції, відмінної від початку файлу, може призвести до неочікуваної поведінки.
     *
     * У програмуванні символ нового рядка (‘\n’) насправді є абстракцією.
     * На Windows новий рядок представлений послідовними CR (carriage return) та LF (line feed) символами (і вони займають 2 bytes)
     * На Unix новий рядок представлений як символ LF (line feed) (займає 1 byte)
     * Тож новий рядок ('\n') займає на різних платформах різну кількість байт і відповідно .seekg() буде працювати по різному,
     * все залежить від того, яке кодування (encoding) використано у файлі.
     *
     * Також у деяких операційних системах файли можуть бути доповнені (padded) нульовими байтами (байтами, що мають значення 0).
     * І в цьому випадку .seekg() буде теж працювати по різному, бо маємо різну кількість байт.
     *
     * seekg() nf seekp() краще використовувати на binary файлах
     *
     * Уявимо ситуацію, у нас є файл
     * Рядок 1: Hi
     * Рядок 2: By
     *
     * На Linux це буде H i \n B y (всього 5 байт)
     * Якщо ми потім перекинемо файл на Windows кількість байт не зміниться, так і буде 5 і коли будемо відкривати файл
     * у редакторі коду то він зрозуміє що це формат Unix і відобразить правильно.
     *
     * А якби ми створили файл на Windows то було би 6 байт, бо \n був би CR+LF і так само, якби ми передали файл
     * на Linux то розмір би лишився той самий, а редактор коду зрозумів би що це кодування Windows.
     */

    example();

    /**
     * функції tellg() та tellp() — це функції у C++, які повертають поточну позицію «курсора» (покажчика)
     * у потоці даних (файлі або рядку)
     *
     * tellg() (g тут від слова get) — використовується для читання. Вона каже, з якої позиції буде
     * прочитано наступний байт із файлу чи потоку.
     *
     * tellp() (p тут від слова put) — використовується для запису. Вона каже, в яку позицію буде записано наступний байт.
     */
    get_file_size_in_bytes();


    /**
     * Давайте розглянемо приклад вводу-виводу файлів з використанням fstream. Ми напишемо програму,
     * яка відкриває файл, читає його вміст і замінює всі знайдені голосні на символ «#».
     *
     *
     * Чому не можна просто читати і писати одночасно? (Проблема буфера)
     * Коли ви працюєте з std::fstream, програма не звертається до жорсткого диска (або SSD) за кожним
     * окремим байтом, бо це було б дуже повільно. Замість цього операційна система виділяє в оперативній
     * пам'яті спеціальну ділянку — буфер.
     *
     * У std::fstream цей буфер один спільний і для читання, і для запису.
     * Коли ви читаєте: Комп'ютер завантажує з диска в буфер великий шматок файлу наперед. Ви читаєте дані з цього буфера.
     *
     * Коли ви пишете: Ваші зміни спочатку накопичуються в цьому ж буфері, і лише згодом (або при закритті файлу)
     * ОС скидає їх одним махом на диск.
     *
     * Якщо ви щось почитали (буфер заповнився даними з диска), а потім одразу без попередження спробуєте записати,
     * потоковий клас fstream заплутається. Він не буде знати, що робити з буфером: чи там зараз містяться дані, які
     * треба зберегти на диск, чи це старі дані, які ви просто зчитували. Без «скидання» ви можете або затерти те, що
     * щойно прочитали, або запис відбудеться зовсім не в те місце файлу.
     *
     * Як тут допомагає переставлення вказівника (seekg / seekp)?
     * Усередині файлового потоку є «вказівник позиції» (file pointer) — це просто число, яке показує, на якому байті файлу ми зараз перебуваємо.
     * Коли ви викликаєте функцію позиціонування, наприклад:
     *      iofile.seekg(iofile.tellg(), std::ios::beg);
     * Ви кажете програмі: «Перемісти вказівник читання в ту саму точку, де він зараз і стоїть».
     *
     * для fstream це критично важливий сигнал. Будь-яка команда зміни позиції (seekg або seekp) змушує fstream виконати дві речі:
     *      1) Очистити або синхронізувати буфер. Якщо там були записані дані, вони негайно відправляються на диск.
     *         Якщо там були дані для читання, вони скидаються, щоб звільнити місце.
     *      2) Оновити внутрішній статус потоку. Потік офіційно перемикається з "режиму читання" в "режим запису" (або навпаки).
     *
     * Нагадую, що seekg - для читання, а seekp - для запису, тож краючись із вказівником ми очищаємо буфер і вказуємо який тип операції
     * зараз будемо робити читання чи запис.
     */

    replace_all_vowel_character();

    return 0;
}
