#include <iomanip>
#include <iostream>

/**
 * Клас istream є основним класом, який використовується під час роботи з вхідними потоками.
 * Standard streams у C++ надає 4 типи стріма:
 *  1) cin -- istream object прив'язаний до стандартного input (typically the keyboard)
 *  2) cout -- ostream object прив'язаний до стандартного output (typically the monitor)
 *  3) cerr -- an ostream прив'язаний до стандартного error (typically the monitor), надає unbuffered output
 *  3) clog -- an ostream прив'язаний до стандартного error (typically the monitor), надає buffered output
 *
 *
 * Небуферизований вивід зазвичай обробляється негайно, тоді як буферизований вивід зазвичай зберігається
 * та записується як блок. Оскільки clog використовується не дуже часто, його часто опускають зі списку
 * стандартних потоків.
 *
 *
 * Одним із способів вирішення цієї проблеми є використання маніпуляторів.
 * Маніпулятор (manipulator) — це об’єкт, який використовується для модифікації потоку при застосуванні
 * операторів вилучення (>>) або вставки (<<). Одним із маніпуляторів є «std::endl», який одночасно виводить
 * символ нового рядка та очищає будь-який буферований (buffered ) вивід.
 * C++ надає маніпулятор, відомий як setw (у iomanip header), який можна використовувати для обмеження
 * кількості символів, що зчитуються з потоку. Щоб використати setw(), просто вкажіть максимальну
 * кількість символів для зчитування як параметр та вставте його у свою інструкцію введення
 *
 *
 *
 * Оператор >> схоже забирає (видаляє) дані за стріма і передає їх нам.
 *
 *
 */

int main() {
    /**
     * У C++ рядки в стилі C обов'язково повинні закінчуватися спеціальним символом — null terminator (\0).
     * Він підказує програмі, де закінчується текст. Коли ми оголошуємо char buf[10], у нас є рівно 10 комірок.
     * Якщо ми вводимо рядок через std::cin >>, оператор автоматично намагається записати \0 в кінці вводу,
     * щоб зробити його валідним рядком.
     * Тобто якщо buf[5] і ми введемо 12345 то на buf[4] у нас буде char 4, а на buf[5] \0
     *
     * Але що станеться, якщо користувач введе 18 символів? Залежить від стандарту C++, якщо C++17 то
     * Буфер переповниться, бо std::cin сприймає buf як вказівник на початок пам'яті (char*) і
     * std::cin запише всі 15 символів + \0 (разом 18 байтів) у пам'ять, починаючи з адреси buf.
     * Оскільки масив має лише 10 байтів, решта 8 байтів перезапишуть сусідні дані в стеку.
     * Це може призвести до:
     *  - Зміни значень інших змінних.
     *  - Аварійного завершення програми (Segmentation fault).
     *  - Уразливості безпеки (так працюють деякі хакерські атаки).
     *
     * Якщо стандарт C++20 то запишеться лише перші 10 байтів, а решта 8 будуть лежати у стрімі.
     * Якщо у нас C++17 то можна скористатися std::setw() він буде працювати так само як у C++20
     */
    // char buf[10]{};
    // std::cin >> buf;
    // std::cout << buf[0] << buf[8] << buf[9] << '\n'; // 08
    //
    //
    // char buf2[10]{};
    // std::cin >> std::setw(10) >> buf2; // Це прочитає лише перші 9 символів зі стріма. Решта символів лишаться у стрімі до наступного звертання до нього
    // std::cout << buf2[0] << buf2[8] << buf2[9] << '\n'; // 08


    /**
     * Уявимо що у нас C++20 і ці два рядки працюють однаково.
     * Якщо ми запустимо ці рядки коду разом і на перший виклик впишемо
     * 0123456789 то отримаємо у терміналі
     * 08
     * 9
     * Тобто перший виклик взяв перші 9 символів +/0 і записав їх у буфер і у стрімі лишився один char 9.
     * Тоді другий виклик одразу візьме що лишилося у стрімі і віддасть його і ми побачимо у терміналі 9
     */


    /**
     * Тут як тільки ми вписуємо щось у стрім він одразу віддає це назад і виводить у термінал.
     *
     * Нагадуємо, що оператор вилучення пропускає пробіли (пробіли, табуляцію та новий рядок).
     *
     * Тобто якщо я введу "My name is Sashko" я отримую "MynameisSashko"
     */
    // char ch{};
    // while (std::cin >> ch)
    //     std::cout << ch;

    /**
     * Якщо ми хочемо зберегти пробіли то варто використати std::cin.get()
     * Якщо я введу "My name is Sashko" я отримую "My name is Sashko"
     */

    // char ch{};
    // while (std::cin.get(ch))
    //     std::cout << ch;

    /**
     * Також у .get() можна другим параметром вставити скільки символів взяти
     * Якщо я введу "My name is Sashko" я отримую "My name is"
     * Лише перші 10 символів будуть взяти і вставлені в strBuf, решта лишиться в стрімі
     */
    // char strBuf[11]{};
    // std::cin.get(strBuf, 11);
    // std::cout << strBuf << '\n';



    /**
     * Одна важлива річ, яку слід зазначити щодо get(), це те, що воно не зчитує символ нового рядка
     * Якщо користувач введе
     *  "
     *  Hello!
     *  "
     * то програма виведе
     *  "
     *  Hello!"
     *
     */

     char strBuf[11]{};
     // Read up to 10 characters
     std::cin.get(strBuf, 11);
     std::cout << strBuf << '\n';

     // Read up to 10 more characters
     std::cin.get(strBuf, 11);
     std::cout << strBuf << '\n';



    /**
     * Відповідно, існує ще одна функція під назвою getline(), яка працює подібно до get(), але витягує (і відкидає) роздільник.
     * Цей код працюватиме належним чином, навіть якщо користувач введе рядок із символом нового рядка.
     */

     char strBuf2[11]{};
     // Read up to 10 characters
     std::cin.getline(strBuf2, 11);
     std::cout << strBuf2 << '\n';

     // Read up to 10 more characters
     std::cin.getline(strBuf2, 11);
     std::cout << strBuf2 << '\n';

     // Якщо потрібно дізнатися, скільки символів було вилучено останнім викликом getline(), можна використати gcount()
     char strBuf3[100]{};
     std::cin.getline(strBuf3, 100);
     std::cout << strBuf3 << '\n';
     std::cout << std::cin.gcount() << " characters were read" << '\n';


    /**
     * A few more useful istream functions:
     *  ignore() discards the first character in the stream.
     *  ignore(int nCount) discards the first nCount characters.
     *  peek() allows you to read a character from the stream without removing it from the stream.
     *  unget() returns the last character read back into the stream so it can be read again by the next call.
     *  putback(char ch) allows you to put a character of your choice back into the stream to be read by the next call.
     */

    return 0;
}