/**
 * =======================================================================================
 * ЕВОЛЮЦІЯ КООПЕРАТИВНОГО ПЕРЕРИВАННЯ ПОТОКІВ В C++
 * (За мотивами книги Ентоні Вільямса «C++ Concurrency in Action»)
 * =======================================================================================
 *
 * Ця нотатка розглядає як викликати переривання в одному потоці з іншого (головного).
 * Для мене це була вельми важка тема, десь на рівні з атомарними операціями. Тут розглянуто
 * три приклади, йдемо від простої реалізації до більш складної яка працює краще.
 *
 *
 * ---------------------------------------------------------------------------------------------------------------------
 *
 * КРОК 1: Базовий концепт (Active Polling) - step_1_interrupt_concept.h
 * Оскільки головний потік не має доступ до змінних нового потоку, то новий потік створює флаг, який
 * за допомогою future повертає головному потоку і він може сигналізувати коли зробити переривання і
 * новий потік це побачить у точці у якій ми зробили перевірку.
 *
 * Чудово працює коли справа стосується звичайного послідовного коду, наприклад циклів. Але виникає
 * проблема якщо потік буде засинати і чекати на щось за допомогою condition_variable та .wait(),
 * наприклад http запит або якась періодична робота (раз на 30 хв наприклад).
 * Уявимо ситуацію, ми робимо перевірку перед засинання у .wait() в цей момент переривання немає, йдемо
 * до наступного кроку (сам сон), але в цей момент головний потік робить переривання і новий потік засинає
 * так нічого і не довідавшись про переривання.
 *
 * ---------------------------------------------------------------------------------------------------------------------
 *
 * КРОК 2: Наївне вирішення блокувань (Timer Polling) - step_2_interrupt_cv_naive.h
 * Вирішує проблему вічного сну на condition_variable за допомогою .wait_for(). Замість стандартного .wait_for()
 * ми пишемо власну обгортку яка робить перевірку і засинає нехай на кожну 1 мс, потім просинається і дивиться
 * знову на умову, чи не було переривань або спрацювання conditional_variable і якщо не було то засинає далі.
 *
 * Проблему з вічним засинання ми вирішили, але такий підхід марнує ресурси процесора на порожні
 * прокидання (polling) та створює затримку зупинки.
 *
 * ---------------------------------------------------------------------------------------------------------------------
 *
 * КРОК 3: Production-Ready рішення (Deep Sleep & Zero CPU) - step_3_interrupt_cv_any.h
 * Повне усунення таймаутів за допомогою std::condition_variable_any та custom_lock.
 * Ми робимо два м'ютекса які зв'язані, якщо блокують один то одразу блокується і другий, і так само якщо один
 * розблоковується то одразу розблоковується і другий. Ми створимо таку умову, що перед викликом переривання стоїть
 * один м'ютекс і перед перевіркою умови на переривання стоїть другий м'ютекс, відповідно якщо умову переривання ми
 * пройшли і йдемо засинати у .wait(), то головний потік блокується неможливо викликати переривання доки новий
 * потік не засне, а як заснув то головний розблоковується і може викликати переривання і тоді новий потік
 * прокинеться і опрацює переривання
 *
 * Потік спить максимально глибоко (0% CPU).
 * Завдяки атомарній синхронізації двох м'ютексів (бізнес-логіки та прапорця), головний потік може розбудити
 * інший потік миттєво й без ризику станів перегонів (Race Condition).
 *
 * ---------------------------------------------------------------------------------------------------------------------
 */


// Робимо імпорти щоб імпортований код працював (особливість через те, як працює #include у namespace)
#include <iostream>
#include <thread>
#include <future>
#include <chrono>
#include <mutex>
#include <condition_variable>
#include <atomic>

// Ізолюємо кожен крок у власний namespace прямо під час імпорту,
// щоб уникнути конфліктів імен і не змінювати код самих хедерів!
namespace step1 {
    #include "step_1_interrupt_concept.h"
};

namespace step2 {
    #include "step_2_interrupt_cv_naive.h"
};

namespace step3 {
    #include "step_3_interrupt_cv_any.h"
};

int main() {

    // Запуск демонстрації багатопотокових переривань

    // step1::main_1();
    // step2::main_2();
    step3::main_3();

    return 0;
}