#include <fstream>
#include <iostream>

/**
 * Basic file I/O
 * Є три базових I/O класи у C++:
 *  1) ifstream - наслідується від istream
 *  2) ofstream  - наслідується від ostream
 *  3) fstream  - наслідується від iostream
 *
 * Ці класи виконують input, output та input/output відповідно.
 */


void create_new_file() {
    /**
     * ofstream використовується для запису файлів
     * Ми створимо файл, який називається Sample.txt
     * Якщо такий файл вже є, тоді це перестворить файл (і всі попередні дані будуть видалені)
     * Сам файл Sample.txt буде лежати або у debug теці, або у release, в залежності від мода в якому згенерували
     */
    std::ofstream outf{ "Sample.txt" };

    // Якщо ми не можемо відкрити output file stream для запису
    if (!outf) {
        std::cerr << "Uh oh, Sample.txt could not be opened for writing!\n";
        return;
    }

    // Записуємо дані у файл
    outf << "This is line 1\n";
    outf << "This is line 2\n";


    // Коли outf вийде із scope, тоді destructor ofstream закриє файл
}


void read_from_file() {
    // ifstream використовується для  читання файлів
    //  Читаємо дані з файлу Sample.txt (який у теці debug або release, в залежності від мода)
    std::ifstream inf{ "Sample.txt" };

    //Якщо ми не змогли відкрити output file stream для читання
    if (!inf) {
        std::cerr << "Uh oh, Sample.txt could not be opened for reading!\n";
        return;
    }

    std::string strInput{};
    // До поки є що читати, то витягаємо це у strInput і виводимо у термінал
    // ifstream поверне 0 якщо ми досягнемо кінця файлу (end of the file (EOF))
    // while (inf >> strInput) {
    //     std::cout << strInput << '\n';
    // }

    /**
     * Такий while виведе це у термінал:
     * line
     * 1
     * This
     * is
     * line
     * 2
     */

    // якщо ми хочемо читати по цілому рядку, то варто використати std::getline()
    while (std::getline(inf, strInput)) {
        std::cout << strInput << '\n';
    }
    /**
     * Це виведе у термінал:
     * This is line 1
     * This is line 2
     */


    // Коли inf вийде із scope, тоді destructor ifstream закриє файл
}


void append_to_file() {
    /**
     * Ми створимо файл, який називається Sample.txt, але якщо він вже існує, то ми відкриваємо
     * його і будемо у нього дописувати, не перезаписуючи старі дані
     */
    std::ofstream outf{ "Sample.txt", std::ios::app };

    // Якщо ми не можемо відкрити output file stream для запису
    if (!outf) {
        std::cerr << "Uh oh, Sample.txt could not be opened for writing!\n";
        return;
    }

    // Дописуємо нові дані у файл до вже існуючих
    outf << "This is line 3\n";
    outf << "This is line 4\n";


    // Коли outf вийде із scope, тоді destructor ofstream закриє файл
}


void explicitly_open_close_file() {
    // Явне відкриття файлів за допомогою open()

    std::ofstream outf{ "Sample2.txt" };
    outf << "This is line 1\n";
    outf << "This is line 2\n";
    outf.close(); // Явно закриваємо файл

    outf << "This is line 3\n"; // Буде помилка, бо файл закритий, але exception не з'явиться. натомість буде встановлено прапорець помилки failbit і цей рядок не занесеться у файл
    outf.open("Sample2.txt", std::ios::app); // Явно відкриваємо файл (також це викликає .clear() і стирає старі помилки failbit)
    outf << "This is line 4\n"; // Видасть помилку, бо файл закритий
    outf.close();

    /**
     * Ось що буде у файлі:
     * This is line 1
     * This is line 2
     * This is line 4
     */

}

int main() {
    create_new_file();

    read_from_file();

    append_to_file();

    explicitly_open_close_file();

    /**
     * Buffered output
     * Output у C++ швидше за все буде буферезований. Це означає, що будь що, що потрапить у output stream
     * не буде миттєво передано, натомість буде чекати доки буфер на заповниться (або не пройде якийсь критичний час).
     *
     * Навіщо це потрібно
     *  - Запис даних на файл (istream): Оперативна пам'ять дуже швидка, а диск (ssd чи hdd) значно повільніший,
     *                                   тож доцільно спочатку накопичити певну кількість даних яку ми хочемо записати,
     *                                   а тоді передати все за один раз по шині даних і записати на диск.
     *
     *  - Читання даних з файлу (ostream): Тут трохи навпаки, оскільки ssd/hdd не вміють читати по 1 байту, вони читають один
     *                                     блок, тобто 4 або 8 kB. Якщо ми читаємо 1 символ, то процесор візьме 4 kB і видалить
     *                                     все окрім першого символу. Якби ми одразу так передавали, то це багато зайвої роботи, доцільніше
     *                                     прочитати одразу весь блок і покласти його в оперативний пам'ять. Тобто ми один раз зчитали все з
     *                                     диску і коли програма просить другий чи третій символ ми одразу читаємо його з оперативної пам'яті,
     *                                     не звертаючись до повільного ssd/hdd.
     *
     * Навіть якщо дані вже зчитані з диска і знаходяться в кеші самої операційної системи (Kernel Buffer Cache), кожне
     * звернення програми до ОС через функцію читання — це системний виклик (syscall).
     * Щоб зробити syscall, процесор виконує апаратне перемикання контексту:
     *  - Зберігає всі регістри вашої програми.
     *  - Перемикається в режим ядра (Kernel Mode).
     *  - Перевіряє права доступу до файлу.
     *  - Копіює дані з пам'яті ядра в пам'ять програми.
     *  - Перемикається назад у режим користувача (User Mode) та відновлює стан програми.
     *
     * Цей процес займає близько 100–300 наносекунд процесорного часу. Якщо ви читаєте файл розміром 10 МБ посимвольно без буфера,
     * ви зробите 10 000 000 системних викликів. Ваша програма витратить кілька секунд суто на перемикання процесора туди-сюди,
     * навіть якщо диск працює зі швидкістю світла.
     *
     * Буфер при читанні потрібен для того, щоб:
     *  - Не смикати диск заради кількох байт, а забирати дані великими фізичними блоками.
     *  - Не навантажувати процесор мільйонами безглуздих системних викликів.
     *
     */


    /**
     * Очищення буфера у C++ називається flushed  і воно автоматично відбувається при закритті файлу читання/запису
     * вбо за допомогою ostream::flush() або std::endl
     *
     * З очисткою буфера є потенційна проблема, уявимо що буфер наповнюється і в цей момент програма неочікувано падає або викликається exit()).
     * У цьому випадку деструктор класу ostream/istream не встигнуть викликатися відповідно файл не буде закрито і відповідно буфер не буде очищено.
     * І відповідно дані які були у буфері і мали бути записані на диск не будуть записані на диску і будуть втрачені.
     *
     * Тому ostream::flush() може бути вельми корисним для негайного запису вмісту буфера на диск, на випадок аварійного завершення роботи програми.
     *
     * Але варто пам'ятати, що надмірне вивільнення буферу буде сповільнювати роботу програми.
     *
     */


    /**
     * File modes
     * Коли ми створюємо std::ofstream чи std::ifstream ми можемо вказати додаткові флаги, які вкажуть як наш стрім має поводитися.
     *
     * app - Відкриває файл у append mode (моді додавання до вже написаного, а не перезаписування існуючого)
     * ate - Перехід до кінця файлу перед читанням/записом
     * binary - Відкриває файл у binary mode (замість text mode)
     * in - Відкриває файл у read mode (стоїть за замовченням для ifstream)
     * out - Відкриває файл у write mode (стоїть за замовченням для ofstream)
     * trunc - Стирає файл, якщо він вже існує
     *
     * Ці флаги можна поєднувати, у fstream за замовченням стоїть std::ios::in | std::ios::out file mode
     *
     * Примітка:
     * Через особливості реалізації fstream операція може завершитися невдачею, якщо використовується режим std::ios::in, а файл,
     * який відкривається, не існує. Якщо вам потрібно створити новий файл за допомогою fstream, використовуйте виключно режим std::ios::out.
     */



    return 0;
}