#include <algorithm>
#include <array>
#include <iostream>
#include <vector>


/**
 * Iterators
 * Масиви (std::vector, std::array, C-style array) можна перебирати циклом for чи while, але не всі контейнери
 * так можна перебрати. Такий підхід не підійде для LinkedList чи Trees. А ітератори це універсальний спосіб
 * робити ітерації по контейнеру (якщо він реалізує цей механізм) однаково для різних структур даних.
 *
 * До прикладу у стандартній бібліотеці STL (Standard Template Library) алгоритми std::sort або std::find
 * не працюють з контейнерами напряму. Вони працюють з ітераторами. Це дозволяє написати один алгоритм,
 * який буде однаково ефективним і для масиву, і для зв'язаного списку.
 *
 * Ітератор — це об'єкт, призначений для переміщення по контейнеру (наприклад, значенням у масиві або символам у рядку),
 * забезпечуючи доступ до кожного елемента на цьому шляху.
 *
 * Контейнер може реалізовувати різні типи ітераторів. Наприклад, контейнер масиву може пропонувати прямий ітератор,
 * який проходить по масиву в прямому порядку, та зворотний ітератор, який проходить по масиву у зворотному порядку.
 *
 *
 * Кожен стандартний контейнер надає методи для отримання ітераторів:
 *  begin(): Повертає ітератор на перший елемент.
 *  end(): Повертає ітератор на елемент, що йде за останнім. Це "бар'єрний" елемент, його не можна разіменовувати.
 *  cbegin() / cend(): Повертають константні ітератори (не дозволяють змінювати елементи).
 *  rbegin() / rend(): Реверсивні ітератори для перебору з кінця до початку.
 */
int main() {

    /**
     * Найпростішим типом ітератора є вказівник, який (за допомогою арифметики вказівників) працює з даними,
     * що послідовно зберігаються в пам'яті.
     */

    std::array array{ 1, 2, 3 };

    /**
     * begin та end це pointer на комірки пам'яті, можна записати так для наочності, але .begin() та .end()
     * це стандартні методи які роблять код лаконічнішим
     *
     * auto begin{ &arr[0] };
     * auto end{ begin + std::size(arr) };
     *
     *
     * std::begin та std::end для масивів у стилі C визначені в заголовку <iterator>.
     * std::begin та std::end для контейнерів, що підтримують ітератори, визначені в заголовкових файлах
     * для цих контейнерів (наприклад, <array>, <vector>).
     *
     */

    auto begin{ array.begin() };
    auto end{ array.end() };

    for (auto p{ begin }; p != end; ++p) { // ++ to move to next element.
        std::cout << *p << ' '; // Indirection to get value of current element.
    }
    std::cout << '\n';


    //******************************************* Iterator invalidation (dangling iterators) *************************************************
    std::cout << "********************* Iterator invalidation *********************" << '\n';

    /**
     * Подібно до pointers та reference, ітератори можуть залишатися «підвішеними (dangling )»,
     * якщо елементи, що перебираються, змінюють адресу або знищуються.
     *
     * В цьому випадку ми маємо вектор під який алокували пам'ять на 4 елементи, а потім додаємо новий елемент
     * і масив перествориться і адреси елементів масиву можуть змінитися, і відповідно тоді ітерація зламається,
     * бо старі .begin() .end() вже будуть не актуальні
     */

    std::vector v { 0, 1, 2, 3 };
    for (auto num : v) {
        if (num % 2 == 0)
            v.push_back(num + 1); // when this invalidates the iterators of v, undefined behavior will result
        std::cout << num << ' '; // 0 1 2 3   замість   0 1 2 3 1 3
    }
    std::cout << '\n';

    for (auto num : v) {
        std::cout << num << ' '; // 0 1 2 3 1 3
    }
    std::cout << '\n';


    /**
     * Інший приклад iterator invalidation
     *
     * Функція erase видаляє елемент на заданій позиції
     * std::vector v{ 1, 2, 3};
     * v.erase(v.begin());
     * v - {2, 3} (перший елемент на позиції 0 було видалено)
     */
    std::vector v2{ 1, 2, 3, 4, 5, 6, 7 };

    auto it{ v2.begin() };
    ++it; // move to second element
    std::cout << *it << '\n'; // ok: prints 2
    v2.erase(it); // erase the element currently being iterated over
    ++it; // undefined behavior
    std::cout << *it << '\n'; // undefined behavior (у мене виводить 4)


    /**
     * Приклади з алгоритмами
     */
    std::vector<int> nums {5,7,25,14,7,0,3};
    std::sort(nums.begin(), nums.end()); // Сортуємо весь вектор
    auto found_value = std::find(nums.begin(), nums.end(), 25); // Шукаємо число 25


    return 0;
}