#include <iostream>
#include <vector>

// return by value
std::vector<int> generate() {
    std::vector arr1 { 1, 2, 3, 4, 5 }; // copies { 1, 2, 3, 4, 5 } into arr1
    return arr1;
}

int main() {
    /**
     * В цьому прикладі
     *  1. Функція generate створює масив arr1, і його як разельтат
     *  2. Створюється temporary object, у який копіюється arr1 і arr1 видаляється з пам'яті
     *  3. Temporary object копіюється у arr2, і temporary object видаляється
     */
    std::vector arr2 { generate() };

    std::cout << arr2[0] << '\n';

    /**
     * Move semantics
     * Основна проблема вище в тому що ми в пусту стоврили temporary object (копіювання дорога операція),
     * а потім ще раз зробили копіювання вже у arr2.
     *
     * Було б набагато краще, якби ми після створення temporary object просто використали його. Тобто
     * після того як його створено ми потім поміняємо йому адресу пам'яті у arr2 і він міститиме всі
     * значення temporary object. Таким чином ми прибрали зайве копіювання.
     *
     *
     *
     * We can return move-capable types (like std::vector and std::string) by value.
     * Such types will inexpensively move their values instead of making an expensive copy.
     *
     *
     * Дорогі для копіювання типи не повинні передаватись за значенням, але якщо вони дозволяють переміщення,
     * їх можна повертати за значенням. І це робиться АВТОМАТИЧНО компілятором, тож нам треба просто
     * поверати дані як значення
     *
     * Існують два рівні автоматичної оптимізації, які запобігають копіюванню:
     * 1. Оптимізація компілятора (Copy Elision / RVO)
     *      Це найкращий сценарій. Компілятор, коли бачить, що ви створюєте локальний об'єкт і відразу повертаєте його,
     *      може повністю уникнути як копіювання, так і переміщення. Це називається Return Value Optimization (RVO) або ширше Copy Elision.
     *
     *      Компілятор "переписує" код таким чином, що об'єкт створюється безпосередньо в пам'яті, призначеній для кінцевого результату,
     *      в області видимості того, хто викликав функцію.
     *
     *  2. Автоматичне застосування Move Semantics
     *      Якщо компілятор не може виконати RVO (через складніший код або через певні обмеження),
     *      він автоматично переходить до другого найкращого варіанту: переміщення.
     *
     *      Коли ви повертаєте локальну змінну, компілятор бачить, що ця змінна є rvalue (тобто, вона тимчасова і її можна безпечно "спустошити").
     *      Якщо тип підтримує переміщення (а std::vector і std::string підтримують), компілятор автоматично викликає конструктор
     *      переміщення (move constructor), щоб перемістити дані замість їх копіювання.
     */

    return 0;
}