#include <algorithm>
#include <iostream>
#include <random>
#include <vector>

bool grater(int a, int b) {
    return (a > b);
}


/**
 * make_heap - створює max binary heap
 * push_heap - додає елемент у вже створений max binary heap
 * pop_heap - видаляє елемент у вже створеному max binary heap
 *
 * sort - сортує масив
 * partial_sort - сортує масив, але лише до певного індексу, який вкажете
 * nth_element - зробить зліва від обраної позиції unspecified order але гарантовано менше від елемента на nth позиції,
 *               а з права гарантовано будуть елементи, що більші за елемент на nth позиції, але також у unspecified order.
 *
 * sort_heap - перетворить binary heap у звичайний відсортований масив.
 * std::inplace_merge — це алгоритм, який з'єднує дві вже відсортовані частини одного контейнера в одну велику відсортовану ділянку.
 * std::partition розділяє масив так, що зліва будуть ті елементи які відповідають умові (на які callback поверне true), а решта буде у правій стороні
 * std::rotate — переставляє елементи так, що обраний вами елемент стає першим, а ті, що були перед ним, "перекочовують" у кінець.
 * shuffle - переміщує елементи масиву
 * next_permutation - перебере всі доступні комбінації
 * prev_permutation - перебере всі можливі доступні у зворотному порядку
 * reverse - змінює порядок у масиву
 *
 * prefix:
 *   stable_ (наприклад, у std::stable_sort або std::stable_partition) гарантує, що елементи з однаковими
 *   значеннями (або ті, що однаково задовольняють умову) збережуть свій початковий відносний порядок.
 *
 *   is_
 *   is_sorted  - повертає true, якщо масив вже відсортований і false якщо ні.
 *   is_partitioned - повертає true, якщо на масиві було застосовано std::partition.
 *   is_heap - повертає true, якщо масив є max binary heap, і повертає false, якщо ні.
 *
 *   is_sorted_until - те саме, що і is_sorted, але до певного індексу
 *   is_partitioned_until - те саме, що і is_partitioned, але до певного індексу
 *   is_heap_until - те саме, що і is_heap, але до певного індексу
 *
 * std::inner_product — це алгоритм із заголовка <numeric>, який за замовчуванням обчислює скалярний добуток двох послідовностей.
 * count - підрахує кількість шуканих елементів у масиві
 *
 * std::accumulate - це класичний алгоритм, який з’явився ще в перших версіях C++. Він працює строго послідовно і додає елементи масиву і повертає суму.
 *                   Незважаючи на назву, він не тільки сумує, можна передати свій callback
 *
 * std::reduce - std::reduce - це сучасний "брат" std::accumulate, створений для швидкості. Головна відмінність: Він не гарантує послідовності.
 *                             Він може додавати числа в будь-якому порядку (наприклад, спочатку 1+2, потім 3+4, а потім результати між собою).
 *                             Тому віднімання у ньому робити НЕ можна, бо для нього не зберігається правильно комутативності
 *
 * std::transform_reduce - це справжній "швейцарський ніж". Він робить дві дії за один прохід:
 *                         Transform: Змінює кожен елемент (наприклад, підносить до квадрата).
 *                         Reduce: Складає змінені елементи докупи.
 *                         Це набагато ефективніше, ніж спочатку створювати новий масив квадратів, а потім його додавати.
 *
 * std::partial_sum - це базовий алгоритм, який працює послідовно. Аналог std::accumulate, але зберігає всі проміжні результати.
 *                    Кожен елемент результату — це сума всіх попередніх елементів включно з поточним.
 *                    Незважаючи на назву цей метод не тільки додає, він працює як і решта і приймає callback
 *                    Вхід: {1, 2, 3, 4}
 *                    Логіка: 1, (1+2), (1+2+3), (1+2+3+4)
 *                    Вихід: {1, 3, 6, 10}
 *
 * inclusive_scan/exclusive_scan -  ці алгоритми прийшли з паралельних обчислень. Вони роблять те саме, що й partial_sum, але можуть працювати паралельно.
 *                   Різниця між Inclusive та Exclusive лише в тому, чи входить поточний елемент у суму. У inclusive_scan входить, у exclusive_scan ні
 *
 * transform_exclusive_scan/transform_inclusive_scan - Вони поєднують у собі дві потужні операції: трансформацію (зміну кожного елемента)
 *                                                     та сканування (накопичувальний підсумок).
 *
 * std::adjacent_difference — це алгоритм, який обчислює різницю між кожним елементом та його попередником. Це зворотна операція до std::partial_sum.
 *
 * std::all_of - повертає true якщо всі елементи масиву відповідають умові, інакше false
 * std::any_of - повертає true якщо хоча б один елемент масиву відповідає умові, інакше false
 * std::none_of - true, якщо жоден елемент не задовольняє умову, інакше false
 *
 * std::equal - повертає true, якщо обидва діапазони мають однакові елементи на тих самих позиціях.
 * std::lexicographical_compare - повертає true, якщо i-тий елемент першого масиву лексикографічно йде перед i-тим
 *                                елементом другого {a,b,c,d} {a,v,c,d} - true, бо 'b' йде перед 'v'
 * std::mismatch - Якщо equal просто каже "false - вони різні" або "true - вони однакові", то mismatch
 *                 каже: "Вони різні, ось перший елемент, який не збігається". Повертає тип Pair, де .first - це елемент
 *                 з першого масиву, а .second, елемент з другого
 *
 * std::find - це найбільш використовуваний алгоритм пошуку. Він просто йде по масиву і шукає перший елемент, який дорівнює заданому значенню.
 *
 * std::adjacent_find - цей алгоритм шукає два однакових елементи, що стоять поруч.
 *                      Як працює: Він порівнює v[0] з v[1], потім v[1] з v[2] і так далі.
 *                      Повертає: Ітератор на перший із двох однакових елементів
 *
 *
 * std::binary_search - повертає true/false в залежності від того чи є шуканий елемент у масиві.
 *                      Назва може збивати з пантелику, але це не бінарний пошук елемента, цей метод лише говорить
 *                      чи є елемент у масиві чи його там не має
 * std::lower_bound - Шукає першу позицію, куди можна вставити число X, не порушуючи порядок сортування.
 *                    Простими словами: Це перший елемент, який не менший за X (тобто a >= X).
 * std::upper_bound - Шукає останню позицію, куди можна вставити число X, не порушуючи порядок.
 *                    Простими словами: Це перший елемент, який суворо більший за X (тобто a > X).
 * Візуалізація різниці:
 *      Уявіть масив, де числа повторюються: {1, 2, 3, 3, 3, 4, 5}. Шукаємо число 3.
 *      lower_bound вкаже на першу трійку.
 *      upper_bound вкаже на четвірку (перше число, що більше за 3).
 *
 * std::equal_range - це "комбо-удар". Він повертає пару ітераторів (std::pair): перший — це результат lower_bound, другий — upper_bound.
 *                    Навіщо це треба? Щоб за один прохід знайти весь піддіапазон однакових елементів
 *
 *
 * search - цей алгоритм шукає перше входження цілої послідовності в іншу послідовність.
 *          Це схоже на те, як працює функція "Знайти" (Ctrl+F), коли ви шукаєте конкретне слово в реченні.
 *
 * std::find_end - цей метод працює майже так само, як std::search, але шукає останнє входження підпослідовності.
 *
 * std::find_first_of - цей алгоритм відрізняється від попередніх. Він не шукає цілу фразу, а шукає хоча б один елемент із набору.
 *                      Що робить: Перебирає основний діапазон і зупиняється, як тільки зустріне будь-який елемент, що є у другому списку.
 *                      Результат: Повертає ітератор на перший знайдений елемент, який присутній у "списку пошуку".
 *
 * max_element - Шукає найбільший елемент у заданому діапазоні.
 * min_element - Шукає найменший елемент у заданому діапазоні.
 * minmax_element - Це "комбо-функція", яка знаходить і мінімум, і максимум за один прохід по контейнеру. Це ефективніше,
 *                  ніж викликати дві попередні функції окремо, бо ми переглядаємо масив лише один раз.
 *
 *
 */
int main() {

    // HEAP

    std::vector<int> v1 {1,2,3,4,5,6,7,8,9};
    std::make_heap(v1.begin(), v1.end()); // 9 8 7 4 5 6 3 2 Ми отримали max binary heap

    /**
     * Було                         9  8 7 4 5 6 3 2
     * Стало після .push_back()     9  8 7 4 5 6 3 2 10
     * Стало після ::push_heap()    10 9 7 4 8 6 3 2 1  5
     */
    v1.push_back(10); // просто додали 10 у кінець масиву
    std::push_heap(v1.begin(), v1.end()); // підніме (бо у нас max binary heap) 10 до потрібного місця, щоб умови max binary heap зберігалися

    /**
     * Було                         9867452031
     * Стало після ::pop_heap()     8763452019
     * Стало після .pop_back()      876345201
     */
    std::pop_heap(v1.begin(), v1.end()); // Видалить перший елемент (найбільший, бо це max binary heap) проведе всі потрібні підстановки і поставить видалений елемент у кінець масиву
    v1.pop_back(); // видалить елемент з кінця


    // SORT
    /**
     * sort
     * partial_sort
     * nth_sort
     * sort_heap
     * inplace_sort
     */
    // звичайний sort
    std::vector<int> nums {5,7,25,14,3,7,0,3};
    std::sort(nums.begin(), nums.end()); // Сортуємо весь вектор 0 3 3 5 7 7 14 25
    std::sort(nums.begin(), nums.end(), grater); // Сортуємо весь вектор у зворотньому порядку 25 14 7 7 5 3 3 0

    /**
     * partial_sort
     * Приймає початок масиву, позицію до якої сортувати і кінець масиву.
     * Якщо ми як позицію зазначимо 4-ий елемент то у нас буде відсортовано перші 4 найменших елементи, а решта у
     * довільному порядку (який там буде порядок залежить від реалізації компілятора. Документація говорить, що буде unspecified order).
     * Тобто partial_sort сортує лише до певної позиції, яку ми вкажемо. Це саме позиція елемента, а не сам елемент.
     * Тут важливо зрозуміти, що коли ми говоримо про позицію, то мається на увазі елемент який стояв би на цій
     * позиції якби ви відсортували масив через sort (nums2.begin() + 4 - це четвертий індекс)
     */
    std::vector<int> nums1 {5,7,25,14,3,7,0,3};
    std::partial_sort(nums1.begin(), nums1.begin() + 4, nums1.end()); // 0 3 3 5   25 14 7 7


    /**
     * nth_element
     * Приймає початок масиву, позицію nth елемента та кінець масиву.
     * nth_element зробить зліва від обраної позиції unspecified order але гарантовано менеше від елемента на nth позиції,
     * а зправа гарантовано будуть елементи, що більші за елемент на nth позиції, але також у unspecified order.
     * Тут важливо зрощуміти, що коли ми говоримо елемент на nth позиції, то мається на увазі елемент який стояв би на цій
     * позиції якби ви відсортували масив через sort (nums2.begin() + 3 - це третій індекс)
     *
     * unspecified order and < nth     nth     unspecified order and > nth
     *
     */
    std::vector<int> nums2 {5,7,25,14,3,7,0,3};
    std::nth_element(nums2.begin(), nums2.begin() + 3, nums2.end()); // 3 3 0   5   7 7 25 14


    /**
     * sort_heap
     * Він перетворить binary heap у звичайний відсортований масив.
     * Варто зрозуміти, що sort_heap не працює на звичайному векторі, йому треба саме binary heap.
     * Бо на звичайному векторі він відсортує не правильно!
     */

    std::vector<int> nums3 {5,7,25,14,3,7,0,3};
    std::make_heap(nums3.begin(), nums3.end()); // робимо max binary heap 25 14 7 7 3 5 0 3
    std::sort_heap(nums3.begin(), nums3.end()); // 0 3 3 5 7 7 14 15


    /**
     * inplace_merge
     * std::inplace_merge — це алгоритм, який з'єднує дві вже відсортовані частини одного контейнера в одну велику відсортовану ділянку.
     * Приймає початок масиву, індекс який вказує де закінчується перша відсортована частина і починається друга, і також кінець масиву.
     *
     * Тут ми вказуємо що індекс 4 - це місце де перший масив закінчився і другий починається
     */

    std::vector<int> nums4 {1,4,8,10,   -1,0,3,9,22};
    std::inplace_merge(nums4.begin(), nums4.begin() + 4, nums4.end()); // -1 0 1 3 4 8 9 10 22


    // partition

    /**
     * partition розділяє масив так, що зліва будуть ті елементи які відповідають умові (на які callback поверне true),
     * а решта буде у правій стороні
     * Результат (один із варіантів): {8, 2, 6, 4, | 5, 3, 7, 1}
     *
     * partition_point - це точка яка розділятиме ліву і праву частину. Тобто це точка зліва від якої всі елементи для яких
     * виконується вимога, а справа ті, до яких вимога не виконується
     *
     * З std::partition відносний порядок елементів у кожній групі не гарантується; якщо порядок важливий, використовується std::stable_partition
     */

    // Умова: число є парним
    std::vector<int> nums5 {1, 2, 3, 4, 5, 6, 7, 8};
    auto partition_point = std::partition(nums5.begin(), nums5.end(), [](int x) {
        return x % 2 == 0;
    });
    // partition_point - 5, тобто це п'ятий індекс. Отже на 5 індексі відбувається перлом, все що до нього - відповідає умові, все що після нього (включаючи його) - ні
    std::cout << "Even number (before): ";
    for (auto i = nums5.begin(); i != partition_point; ++i) {
        std::cout << *i << " "; // 2 4 6 8 10 (порядок може бути іншим)
    }
    std::cout << "\nOdd numbers: ";
    for (auto i = partition_point; i != nums5.end(); ++i) {
        std::cout << *i << " "; // 1 3 5 7 9 (порядок може бути іншим)
    }
    std::cout << std::endl;



    // permutation

    /**
     * rotate
     * std::rotate — це алгоритм, який виконує циклічне зсунення елементів.
     * Він переставляє елементи так, що обраний вами елемент стає першим, а ті, що були перед ним, "перекочовують" у кінець.
     *
     * Функція приймає три ітератори: std::rotate(first, middle, last)
     */
    std::vector<int> nums6 {1, 2, 3, 4, 5, 6, 7, 8};
    std::rotate(nums6.begin(), nums6.begin() + 3, nums6.end()); // 4 5 6 7 8 1 2 3

    /**
     * shuffle
     * Він переміщує елементи масиву
     */

    std::vector<int> nums7 {1, 2, 3, 4, 5, 6, 7, 8};
    std::random_device rd {};
    std::seed_seq sq {rd(), rd(), rd(),rd()};
    std::mt19937 g {sq};
    std::shuffle(nums7.begin(), nums7.end(), g); // 5 6 1 7 4 8 3 2




    /**
     * next_permutation/prev_permutation
     * Уявимо що у нас є масив {1,2,3}
     * Наведений ниже код перебере всі можливі комбінації
     * 1 2 3 (працює завжди бо стоїть ще до умови while)
     * 1 3 2
     * 2 1 3
     * 2 3 1
     * 3 1 2
     * 3 2 1
     *
     * Важливе уточнення, якщо як вхідний масив поставлю {3,2,1} то std::next_permutation(nums8.begin(), nums8.end()) поверне false,
     * бо ця остання лексикографічно більша комбінація. І відповідно я не отримую жодної перестановки
     *
     * Допоки std::next_permutation(nums8.begin(), nums8.end()) може робити перестановку він її робить і повертає true,
     * якщо всі можливі комбінації закінчилися то він повертає false
     *
     * Він переставляє елементи так, щоб отримати наступну за "величиною" комбінацію.
     * Логіка: Алгоритм шукає "найменшу" зміну в кінці масиву, яка зробить масив лексикографічно більшим.
     *
     * std::prev_permutation
     * Працює точно навпаки: переставляє елементи так, щоб отримати попередню за величиною комбінацію (лексикографічно меншу).
     * Уявимо що у нас є масив {3,2,1}
     * Наведений ниже код перебере всі можливі комбінації
     * 3 2 1 (працює завжди бо стоїть ще до умови while)
     * 3 1 2
     * 2 3 1
     * 2 1 3
     * 1 3 2
     * 1 2 3
     */
    std::vector<int> nums8 {1, 2, 3};

    do {
        for(int n : nums8) std::cout << n << " ";
        std::cout << "\n";
    } while (std::next_permutation(nums8.begin(), nums8.end()));
    std::cout << "******************************\n";

    std::vector<int> nums9 {3, 2, 1};
    do {
        for(int n : nums9) std::cout << n << " ";
        std::cout << "\n";
    } while (std::prev_permutation(nums9.begin(), nums9.end()));



    // reverse - змінює порядок у масиву
    std::vector<int> nums10 {1,2,3,4,5,6,7,8};
    std::reverse(nums10.begin(), nums10.end()); // 8 7 6 5 4 3 2 1



    // Приставки до алгоритмів

    /**
     * stable_
     * Приставка stable_ (наприклад, у std::stable_sort або std::stable_partition) гарантує, що елементи з однаковими
     * значеннями (або ті, що однаково задовольняють умову) збережуть свій початковий відносний порядок.
     *
     * std::stable_partition
     * Якщо ви ділите числа на парні та непарні:
     *  Початковий масив: [1(a), 2(b), 3(c), 4(d), 5(e)] (літери для позначення порядку).
     *  std::partition (може бути): [4(d), 2(b), 3(c), 1(a), 5(e)] — парні попереду, але 4 тепер перед 2.
     *  std::stable_partition (гарантовано): [2(b), 4(d), 1(a), 3(c), 5(e)] — парні попереду, і вони йдуть у тому ж порядку, що й були (спочатку 2, потім 4).
     *
     * stable_sort потрібен для сортування по декільком полям. Якщо по одному полю значення однакові, то зберігається початкове сортування
     */

    std::vector<int> nums11 {1,2,3,4,5};
    std::partition(nums11.begin(), nums11.end(), [](int x){
        return x % 2 == 0;
    }); // 4 2 3 1 5

    std::vector<int> nums12 {1,2,3,4,5};
    std::stable_partition(nums12.begin(), nums12.end(), [](int x){
    return x % 2 == 0;
    }); // 2 4 1 3 5


    // stable_sort
    struct Product {
        std::string name;
        int price;
    };
    // Зверніть увагу: вони вже відсортовані за назвою (Apple, Banana, Cherry...)
    std::vector<Product> shop = {
        {"Apple", 50},  {"Banana", 30}, {"Cherry", 50},
        {"Date", 30},   {"Elderberry", 50}, {"Fig", 30}
    };
    std::stable_sort(shop.begin(), shop.end(), [](const Product& p1, const Product& p2) {
       return p1.price < p2.price;
    }); // Banana, Date, Fig, Apple, Cherry, Elderberry (у місцях, де price однаковий збереглося попереднє сортування)


    /**
     * is_
     * is_sorted - Потрібне для того, щоб дізнатися чи масив відсортований,
     * is_partitioned - Потрібне для того, щоб дізнатися чи на масиві застосоване partition
     * is_heap - Потрібне для того, щоб дізнатися чи масив є heap
     *
     * Всі ці методи вище повертають true/false
     *
     * is_*_until - це теж саме, що і просто is_, але до певного індексу
     *
     * is_sorted_until
     * is_partitioned_until
     * is_heap_until
     *
     * is_sorted_until якщо все добре повергає останній елемент масиву, якщо знайшло десь помилку, то елемент на якому сталася помилка.
     * Така сама логіка і для решті is_*_until
     */

    std::vector<int> nums13 {1,2,3,4,5};
    std::vector<int> nums14 {1,2,3,4,6,-1,23,9};
    auto a = std::is_sorted(nums13.begin(), nums13.end()); // true
    auto b = std::is_sorted(nums14.begin(), nums14.end()); // false
    auto c =std::is_sorted_until(nums14.begin(), nums14.begin() + 4); // 6 (перевірив усе до числа 6 (не включаючи його, тобто до індексу 4) і все ок. Все відсортовано
    auto d =std::is_sorted_until(nums14.begin(), nums14.begin() + 5); // -1 (перевірив усе до індексу 5 (не включаючи його і зупинився на числі -1, бо це помилка, воно не відсортоване)
    auto e =std::is_sorted_until(nums14.begin(), nums14.end()); // -1 перевірив весь масив, зупинився на числі -1 бо це перша помилка, число -1 не відсортовано

    if (e != nums.end()) {
        std::cout << "Vector is sorted until element: " << *e << "\n"; // Vector is sorted until element: -1
        std::cout << "Index first error: " << std::distance(nums.begin(), e) << "\n"; // Index first error: 25809
    }



    // Numerical algorithm

    // count - підрахує кількість шуканих елементів у масиві
    std::vector<int> nums15 {1,2,3,4,6,-1,23,1,9,1};
    std::count(nums15.begin(), nums15.end(), 1); // 3
    std::count(nums15.begin(), nums15.end(), 99); // 0


    /**
     * inner_product
     * std::inner_product — це алгоритм із заголовка <numeric>, який за замовчуванням обчислює скалярний добуток двох послідовностей.
     *
     * Для двох масивів A = {a1, a2, a3} та B = {b1, b2, b3} формула буде такою:
     * Результат = початкове_значення + (a1 * b1) + (a2 * b2) + (a3 * b3)
     */

    std::vector<int> a1 {1, 2, 3};
    std::vector<int> b1 {4, 5, 6};

    // 0 — це початкове значення суми
    std::inner_product(a1.begin(), a1.end(), b1.begin(), 0); // Розрахунок: 0 + (1*4) + (2*5) + (3*6) = 0 + 4 + 10 + 18 = 32



    /**
     * std::accumulate
     * std::reduce
     * std::transform_reduce
     *
     * std::accumulate Це класичний алгоритм, який з’явився ще в перших версіях C++. Він працює строго послідовно.
     *
     * std::reduce - це сучасний "брат" accumulate, створений для швидкості
     * Головна відмінність: Він не гарантує послідовності. Він може додавати числа в будь-якому порядку
     * (наприклад, спочатку 1+2, потім 3+4, а потім результати між собою).
     *  Навіщо це треба? Це дозволяє процесору виконувати додавання паралельно на кількох ядрах.
     *  Обмеження: Операція має бути асоціативною (як додавання: (1+2)+3 це те саме, що 1+(2+3)).
     *  Для віднімання reduce використовувати не можна, бо результат буде залежати від випадку.
     *      -1-2-3 - поставимо дужки для визначення пріоритетності операцій
     *      (1-2)-3 = -1-3=-4
     *      1-(2-3) = 1--1 = 2
     *
     * std::transform_reduce
     * Це справжній "швейцарський ніж". Він робить дві дії за один прохід:
     *  Transform: Змінює кожен елемент (наприклад, підносить до квадрата).
     *  Reduce: Складає змінені елементи докупи.
     * Це набагато ефективніше, ніж спочатку створювати новий масив квадратів, а потім його додавати.
     */

    std::vector<int> nums16 {1, 2, 3, 4};
    int sum = std::accumulate(nums16.begin(), nums16.end(), 0); // Результат: 10
    int diff = std::accumulate(nums16.begin(), nums16.end(), 0, [](int a, int b) {
        return (a-b);
    }); // Результат: -10 (Кроки 0-1, -1-2, -3-3, -6-4 => -10)

    int sum2 = std::reduce(nums16.begin(), nums16.end(), 0); // Результат: 10
    int sum3 = std::reduce(nums16.begin(), nums16.end(), 0, [](int a, int b) { // передамо callback
            return a + b;
        });

    int sum_sq = std::transform_reduce(nums.begin(), nums.end(), 0,
        std::plus<>(),                    // Як з'єднувати (Reduce)
        [](int x) { return x * x; }  // Що робити з кожним (Transform)
    );
    // Розрахунок: 1*1 + 2*2 + 3*3 + 4*4 = 1 + 4 + 9 + 16 = 30



    /**
     * std::partial_sum
     * inclusive_scan
     * exclusive_scan
     * transform_exclusive_scan
     * transform_inclusive_scan
     *
     * std::partial_sum (класика)
     * Це базовий алгоритм, який працює послідовно. Кожен елемент результату — це сума всіх попередніх елементів включно з поточним.
     * Незважаючи на назву цей метод не тільки додає, він працює як і решта і приймає callback
     *      Вхід: {1, 2, 3, 4}
     *      Логіка: 1, (1+2), (1+2+3), (1+2+3+4)
     *      Вихід: {1, 3, 6, 10}
     *
     * Inclusive vs Exclusive Scan (C++17)
     * Ці алгоритми прийшли з паралельних обчислень. Вони роблять те саме, що й partial_sum, але можуть працювати паралельно.
     * Різниця між Inclusive та Exclusive лише в тому, чи входить поточний елемент у суму.
     *
     * inclusive Scan (Включно)
     * Поточний елемент включається у розрахунок. Це фактично паралельна версія partial_sum.
     *      Вхід: {1, 2, 3, 4}, початкове значення: 0
     *      Логіка: (0+1), (0+1+2), (0+1+2+3), (0+1+2+3+4)
     *      Результат: {1, 3, 6, 10}
     *
     * Exclusive Scan (Виключно)
     * Поточний елемент не включається у розрахунок (береться лише сума попередніх).
     *      Вхід: {1, 2, 3, 4}, початкове значення: 0
     *      Логіка: 0, (0+1), (0+1+2), (0+1+2+3)
     *      Результат: {0, 1, 3, 6} (Останній елемент масиву 4 взагалі не вплинув на результат на своїй позиції).
     *
     *
     * transform_exclusive_scan/transform_inclusive_scan
     * Вони поєднують у собі дві потужні операції: трансформацію (зміну кожного елемента) та сканування (накопичувальний підсумок).
     *
     */

    std::vector<int> nums17 {1,2,3,4,5,6};
    std::vector<int> result17(nums17.size());
    std::partial_sum(nums17.begin(), nums17.end(), result17.begin(),[](int a, int b) { // передамо callback
            return a + b;
    }); // 1 3 6 10 15 21

    std::vector<int> result17_2(nums17.size());
    std::inclusive_scan(nums17.begin(), nums17.end(), result17_2.begin(),[](int a, int b) { // передамо callback
            return a + b;
    }); // 1 3 6 10 15 21


    // На відміну від partial_sum, який бере перший елемент масиву як стартовий, exclusive_scan вимагає, щоб ви явно вказали, з чого починати. Починаємо з 0
    std::vector<int> result17_3(nums17.size());
    std::exclusive_scan(nums17.begin(), nums17.end(), result17_3.begin(),0,[](int a, int b) { // передамо callback
            return a + b;
    }); // 0 1 3 6 10 15  |  Якби почали з 4 то було б 4 5 7 10 14 19


    std::vector<int> result17_4(nums17.size());
    std::transform_inclusive_scan(nums17.begin(), nums17.end(), result17_4.begin(),
        std::plus<>(),                              // transform - додаємо
        [](int x) { return x * x; });  // що робимо з кожним
    /**
     * nums17 = 1 2 3 4 5 6 7
     * result = 1 5 14 30 55 91
     * 1^2 = 1
     * 1^2 + 2^2 = 5
     * 1^2 + 2^2 + 3^2 = 14
     * ...
     */

    // В якості початкового значення поставимо 5
    std::vector<int> result17_5(nums17.size());
    std::transform_exclusive_scan(nums17.begin(), nums17.end(), result17_5.begin(), 5,
        std::plus<>(),                              // transform - додаємо
        [](int x) { return x * x; });  // що робимо з кожним
    /**
     * nums17 = 1 2 3 4 5 6 7
     * result = 5 6 10 19 35 60
     * 5 = 5
     * 5 + 1^2 = 6
     * 5 + 1^2 + 2^2 = 10
     * 5 + 1^2 + 2^2 + 3^2 = 19
     * ...
     */


    /**
     * std::adjacent_difference
     * std::adjacent_difference — це алгоритм, який обчислює різницю між кожним елементом та його попередником.
     * Це зворотна операція до std::partial_sum.
     */

    std::vector<int> result18 {100, 110, 115, 125};
    std::vector<int> consumption(result18.size());
    std::adjacent_difference(result18.begin(), result18.end(), consumption.begin());
    /**
     * 100 (перший без змін)
     * 110 - 100 = 10
     * 115 - 110 = 5
     * 125 - 115 = 10
     * Вивід: {100, 10, 5, 10}
     */

    // Наприклад, щоб перевірити, чи зріс показник порівняно з попереднім:
    std::vector<int> v {1, 2, 0, 4};
    std::vector<int> grew(v.size());
    std::adjacent_difference(v.begin(), v.end(), grew.begin(), [](int current, int prev) {
        return current > prev;
    }); // {1, 1, 0, 1} (перший елемент 1 копіюється, далі true(1)/false(0))



    /**
     * std::all_of - повертає true якщо всі елементи масиву відповідають умові, інакше false
     * std::any_of - повертає true якщо хоча б один елемент масиву відповідає умові, інакше false
     * std::none_of - true, якщо жоден елемент не задовольняє умову, інакше false
     */

    std::vector<int> nums19 {1,2,3,4,5,6};
    bool is_all_bigger_0 = std::all_of(nums19.begin(), nums19.end(), [](int x) {
        return x > 0;
    }); // true

    bool no_negative = std::none_of(nums19.begin(), nums19.end(), [](int x) {
        return x < 0;
    }); // true



    /**
     * std::equal
     * std::lexicographical_compare
     * std::mismatch
     *
     * Ці три алгоритми використовуються для порівняння двох послідовностей (масивів, векторів тощо).
     * Вони допомагають зрозуміти: чи однакові вони, хто з них "менший" за алфавітом, і де саме вони починають відрізнятися.
     *
     * std::equal
     * Це найпростіша перевірка на повну ідентичність. Він повертає true, якщо обидва діапазони мають однакові елементи на тих самих позиціях.
     *
     *
     * std::lexicographical_compare
     * Цей алгоритм працює як сортування слів у словнику. Він визначає, яка послідовність йде "першою"
     *  Логіка:
     *      Порівнює перші різні елементи. Якщо a[i] < b[i], то перший масив менший.
     *      Якщо один масив є префіксом іншого (наприклад, "cat" і "cats"), то коротший масив вважається меншим.
     *
     *
     * std::mismatch
     * Це "детектив". Якщо equal просто каже "ні, вони різні", то mismatch каже: "Ось тут вони перестали бути однаковими".
     *
     */

    std::vector<int> nums20 {1, 2, 3};
    std::vector<int> nums21 {1, 2, 3};
    bool is_same = std::equal(nums20.begin(), nums20.end(), nums21.begin(), nums21.end()); // true

    std::vector<int> nums22 {1, 2, 3};
    std::vector<int> nums23 {1, 2, 4};
    bool less1 = std::lexicographical_compare(nums22.begin(), nums22.end(), nums23.begin(), nums23.end()); // true, бо 3 < 4
    bool less2 = std::lexicographical_compare(nums20.begin(), nums20.end(), nums21.begin(), nums21.end()); // false, бо однакові

    std::vector<int> nums24 {1, 3, 3};
    std::vector<int> nums25 {1, 2, 4};
    bool less3 = std::lexicographical_compare(nums24.begin(), nums24.end(), nums25.begin(), nums25.end()); // false, бо 3 не менше 2

    std::vector<char> chars1 {'a', 'b', 'c', 'd'};
    std::vector<char> chars2 {'a', 'v', 'c', 'd'};
    bool less4 = std::lexicographical_compare(chars1.begin(), chars1.end(), chars2.begin(), chars2.end()); // true


    std::vector<int> nums26 {1, 2, 3, 4, 5};
    std::vector<int> nums27 {1, 2, 0, 4, 5};
    auto res = std::mismatch(nums26.begin(), nums26.end(), nums27.begin());

    if (res.first != v1.end()) {
        std::cout << "First mismatch: " << *res.first << " vs " << *res.second << "\n"; // Виведе: 3 vs 0
    }



    /**
     * std::find
     * std::adjacent_find
     *
     * std::find
     * Це найбільш використовуваний алгоритм пошуку. Він просто йде по масиву і шукає перший елемент, який дорівнює заданому значенню.
     *
     *
     * std::adjacent_find
     * Цей алгоритм шукає два однакових елементи, що стоять поруч.
     * Як працює: Він порівнює v[0] з v[1], потім v[1] з v[2] і так далі.
     * Повертає: Ітератор на перший із двох однакових елементів
     */
    std::vector<int> nums28 {10, 20, 30, 40};
    auto it1 = std::find(nums28.begin(), nums28.end(), 30);
    if (it1 != nums28.end()) {
        std::cout << "found: " << *it1; // 30
    }

    std::vector<int> nums29 {1, 2, 2, 3, 4, 4, 5};
    auto it2 = std::adjacent_find(nums29.begin(), nums29.end());

    if (it2 != nums29.end()) {
        std::cout << "First double pairs start from: " << *it2 << '\n';  // Виведе 2 (Тобто він посилається на pointer на індексі 1 і це є число 2)
    }



    /**
     * std::equal_range
     * std::lower_bound
     * std::upper_bound
     * std::binary_search
     *
     * Ці чотири алгоритми — це серце бінарного пошуку в C++. Вони надзвичайно швидкі O(log N),
     * але мають одну залізну умову: масив повинен бути відсортованим.
     *
     *
     * std::lower_bound - шукає першу позицію, куди можна вставити число X, не порушуючи порядок сортування.
     * Простими словами: Це перший елемент, який не менший за X (тобто a >= X).
     *
     * std::upper_bound - шукає останню позицію, куди можна вставити число X, не порушуючи порядок.
     * Простими словами: Це перший елемент, який суворо більший за X (тобто a > X).
     *
     * Візуалізація різниці:
     * Уявіть масив, де числа повторюються: {1, 2, 3, 3, 3, 4, 5}. Шукаємо число 3.
     *      lower_bound вкаже на першу трійку.
     *      upper_bound вкаже на четвірку (перше число, що більше за 3).
     *
     * std::binary_search - алгоритм не каже, де знаходиться елемент. Він лише відповідає на питання: "Він там взагалі є?".
     *      Це не дуже очевидно з назви, адже ми очікуємо що це буде бінарний пошук
     *      Повертає: bool (true/false).
     *      Нюанс: Всередині він часто викликає lower_bound, тому якщо вам потім все одно треба працювати з ітератором,
     *      краще відразу використовувати lower_bound.
     *
     * std::equal_range - це "комбо-удар". Він повертає пару ітераторів (std::pair): перший — це результат lower_bound, другий — upper_bound.
     *                    Навіщо це треба? Щоб за один прохід знайти весь піддіапазон однакових елементів
     *
     */

    std::vector<int> nums30 {1, 2, 4, 4, 4, 6, 7};

    auto s0 = std::binary_search(nums30.begin(), nums30.end(), 6); // true

    auto s1 = std::lower_bound(nums30.begin(), nums30.end(), 4); // 4 (Посилається на першу 4)
    std::cout << "s1 index: " << std::distance(nums30.begin(), s1) << "\n"; // 2

    auto s2 = std::upper_bound(nums30.begin(), nums30.end(), 4); // 6 (Посилається на першу 6)
    std::cout << "s2 index: " << std::distance(nums30.begin(), s2) << "\n"; // 5

    auto s3 = std::upper_bound(nums30.begin(), nums30.end(), 9); // 7 (Посилається на першу 7) Бо не має більшого значення, тому береться кінець масиву
    std::cout << "s3=nums30.end(): " << (s3 == nums30.end()) << "\n"; // 1 (Що означає true)
    std::cout << "s3 index: " << std::distance(nums30.begin(), s3) << "\n"; // 7

    std::vector<int> nums31 {1, 2, 4, 4, 4, 6, 7};
    std::vector<int> nums32 {1, 2, 4, 4, 4, 6, 7};
    auto s5 = std::upper_bound(nums31.begin(), nums31.end(), 6); // 7 - посилається на елемент 7 (індекс 6)
    auto s6 = std::upper_bound(nums32.begin(), nums32.end(), 10); // посилається на елемент nums32.end(), тобто на індекс 7 (його не існує)


    std::vector<int> nums33 {1, 2, 4, 4, 4, 6, 7};
    auto range = std::equal_range(nums33.begin(), nums33.end(), 4);
    auto count = std::distance(range.first, range.second);
    std::cout << "Count of 4s: " << count << "\n"; // 3




    /**
     * search
     * find_end
     * find_first_of
     *
     * search - цей алгоритм шукає перше входження цілої послідовності в іншу послідовність.
     * Це схоже на те, як працює функція "Знайти" (Ctrl+F), коли ви шукаєте конкретне слово в реченні.
     *
     * std::find_end - цей метод працює майже так само, як std::search, але шукає останнє входження підпослідовності.
     *
     * std::find_first_of - цей алгоритм відрізняється від попередніх. Він не шукає цілу фразу, а шукає хоча б один елемент із набору.
     *                      Що робить: Перебирає основний діапазон і зупиняється, як тільки зустріне будь-який елемент, що є у другому списку.
     *                      Результат: Повертає ітератор на перший знайдений елемент, який присутній у "списку пошуку".
     *
     */

    std::vector<int> nums34 = {1, 2, 3, 4, 1, 2, 3, 4};
    std::vector<int> pattern = {2, 3};
    auto it3 = std::search(nums34.begin(), nums34.end(), pattern.begin(), pattern.end());
    // 'it3' вкаже на nums34[1] (перша двійка)

    auto it4 = std::find_end(nums34.begin(), nums34.end(), pattern.begin(), pattern.end());
    // 'it4' вкаже на v[5] (двійка, що ближче до кінця)



    std::vector<int> nums35 = {10, 20, 30, 40, 50};
    std::vector<int> targets = {35, 30, 15}; // шукаємо або 35, або 30, або 15
    auto it5 = std::find_first_of(nums35.begin(), nums35.end(), targets.begin(), targets.end());
    // 'it' вкаже на v[2] (тобто на число 30), бо це перший елемент з nums34, який також є в targets.




    /**
     * max_element
     * min_element
     * minmax_element
     *
     * std::max_element - Шукає найбільший елемент у заданому діапазоні.
     *                    Що повертає: Ітератор на перше входження найбільшого елемента.
     *
     * std::minmax_element - Це "комбо-функція", яка знаходить і мінімум, і максимум за один прохід по контейнеру.
     *                       Це ефективніше, ніж викликати дві попередні функції окремо, бо ми переглядаємо масив лише один раз.
     *      Що повертає: Спеціальну структуру std::pair, яка містить два ітератори:
     *          first — ітератор на мінімальний елемент.
     *          second — ітератор на максимальний елемент.
     *      Особливість: Якщо є кілька однакових значень, first вкаже на перше входження мінімуму, а second — на останнє входження максимуму.
     *
     */

    std::vector<int> nums36 = {3, 1, 9, 4, 9, 2};
    auto it6 = std::max_element(nums36.begin(), nums36.end());
    if (it6 != nums36.end()) {
        std::cout << "Max: " << *it6; // Виведе 9
    }

    auto it7 = std::min_element(nums36.begin(), nums36.end());
    if (it7 != nums36.end()) {
        std::cout << "Min: " << *it7; // Виведе 1
    }


    std::vector<int> nums37 = {5, 2, 8, 1, 9, 9, 1};
    auto result = std::minmax_element(nums37.begin(), nums37.end());
    std::cout << "Min: " << *(result.first);  // 1 (перша одиниця)
    std::cout << "Max: " << *(result.second); // 9 (остання дев'ятка)



    /**
     * std::copy
     * std::move
     * std::swap_ranges
     *
     * std::fill
     * std::generate
     * std::iota
     * std::replace
     * std::remove
     * erase
     * unique
     *
     * *_copy
     * *_if
     */


    int x {};


    return 0;
}
